-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {}

Config.Locale = {
	Notification = {
		no_player_nearby = 'ไม่พบผู้เล่นใกล้คุณ',		-- ข้อความแจ้งเตือนเมื่อไม่พบใกล้เคียง
		no_watergun = 'กรุณาถือปืนฉีดน้ำ',		-- ข้อความแจ้งเตือนเมื่อไม่ได้ถือปืนฉีดน้ำ
		water_full = 'คุณไม่จำเป็นต้องเติมน้ำ',		-- ข้อความแจ้งเตือนเมื่อไม่จำเป็นต้องเติมน้ำ	
		no_have_money = 'คุณมีเงินไม่เพียงพอ',		-- ข้อความแจ้งเตือนเมื่อมีเงินไม่เพียงพอ
		no_item = 'คุณไม่มีไอเทมในการเติมน้ำ',		-- ข้อความแจ้งเตือนเมื่อไม่มีไอเทมในการเติมน้ำ
		cannot_check  = 'ไม่สามารถเช็คไอเทมหรือเงินได้',		-- ข้อความแจ้งเตือนเมื่อไม่สามารถเช็คไอเทมหรือเงินได้
		refilling_success = 'เติมน้ำใส่ปืนฉีดน้ำเรียบร้อยแล้ว'		-- ข้อความแจ้งเตือนเมื่อเติมน้ำใส่ปืนฉีดน้ำแล้ว
	}
}