-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {}

Config.Locale = {
    Notification = {
        event_joined = 'คุณเข้าร่วมกิจกรรมซ่อนแอบแล้ว',       -- ข้อความแจ้งเตือนเมื่อเข้าร่วมกิจกรรมซ่อนแอบแล้ว
        event_player_full = 'ผู้เล่นที่เข้าร่วมกิจกรรมซ่อนแอบเต็มแล้ว',       -- ข้อความแจ้งเตือนเมื่อผู้เล่นที่เข้าร่วมกิจกรรมซ่อนแอบเต็มแล้ว
        event_not_enough_players = 'กิจกรรมถูกยกเลิกเนื่องจากผู้เล่นไม่เพียงพอ',       -- ข้อความแจ้งเตือนเมื่อผู้เล่นไม่เพียงพอในการเล่นกิจกรรม
        blacklist_prop = 'คุณไม่สามารถแปลงร่างเป็นสิ่งของนี้ได้'     -- ข้อความแจ้งเตือนเมื่อไม่สามารถแปลงร่างเป็นสิ่งของได้
    },
}