-- ██████╗  █████╗ ██████╗ ██████╗ ██╗████████╗    ██████╗ ███████╗██╗   ██╗
-- ██╔══██╗██╔══██╗██╔══██╗██╔══██╗██║╚══██╔══╝    ██╔══██╗██╔════╝██║   ██║
-- ██████╔╝███████║██████╔╝██████╔╝██║   ██║       ██║  ██║█████╗  ██║   ██║
-- ██╔══██╗██╔══██║██╔══██╗██╔══██╗██║   ██║       ██║  ██║██╔══╝  ╚██╗ ██╔╝
-- ██║  ██║██║  ██║██████╔╝██████╔╝██║   ██║       ██████╔╝███████╗ ╚████╔╝ 
-- ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝ ╚═════╝ ╚═╝   ╚═╝       ╚═════╝ ╚══════╝  ╚═══╝  
-- https://discord.gg/GfvECJ4Z8q

Locales = {
    ['loading'] = "กำลังโหลด Emotes",
    ['stunned'] = "ไม่สามารถเปิดหน้าต่างได้ขณะติดสถานะ",
    ['blocked'] = "อยู่ในสถานะไม่พร้อมใช้งาน",
    ['restricted_area'] = "คุณอยู่ในจุดที่ไม่สามารถใช้หน้าจอ Emotes ได้",
    ['send_request_to'] = "ส่งคำขอไปยัง",
    ['no_one_near_you'] = "ไม่มีใครอยู่ใกล้คุณ",
    ['disable_hotkeys'] = "ปิดการทำงานของ Hotkey",
    ['combat_hotkeys'] = "ไม่สามารถใช้ Hotkey ขณะกำลังต่อสู้",
    ['cooldown_hotkeys'] = "Hotkey ติดสถานะ Cooldown",
    ['shared_emotes'] = "ผู้เล่น %s [Identifier: %s] แชร์อีโมท %s กับ ผู้เล่น %s [Identifier: %s]",

    -- Ui
    ["UI"] = {
        ['search'] = "ค้นหา",
        ['blank'] = "ว่าง",
        ['choose'] = "เลือก",
        ['close_the_window'] = "ปิดหน้าต่างเมื่อเลือกแสดงท่าทาง",
        ['footer'] = {
            ["1"] = "Tip ! กด ",
            ["2"] = "ALT ซ้าย ",
            ["3"] = "เพื่อเปลี่ยนโฟกัส ระหว่างควบคุมตัวละคร หรือ หน้าต่าง Emotes | กด",
        }
    }
}