-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

Config.Punishing['illegal_spawned_object'] = {						-- ป้องกันการสร้าง OBJECT อย่างไม่ถูกต้อง
	enable = true,
	punish = 'ban',								-- 'none|kick|ban' [none: ไม่ทำอะไร | kick: เตะผู้เล่น | ban: แบนผู้เล่น]
	attempt = 1,								-- จำนวนครั้งที่ผู้เล่นสามารถกระทำผิดได้
	attempt_time = 15 * 60,						-- ระยะเวลาที่ไม่อนุญาตให้ผู้เล่นทำผิดซ้ำได้อีก (จะมีผลกรณีที่ attempt > 1) *หน่วยเป็นวินาที | Default: 60 วินาที
	alert = {
		kick = 'Suspicious action detected, ตรวจพบการกระทำต้องสงสัย',
		ban = 'สร้าง %s อย่างไม่ถูกต้อง'
	},
	discord_log = {
		webhook = 'https://discord.com/api/webhooks/1221759049041969184/Tqksbp_ITPVbrupNIltMcAdqDdbNKYbi6Vf_uhZNQIH7_86XecwwCeEOlyXCI3En1tLm',
		message = 'สร้าง %s อย่างไม่ถูกต้อง',
		screenshot = true
	},
	admin_notification = {
		enable = true,
		title = 'ตรวจพบผู้กระทำผิด',
		description = 'ผู้เล่นไอดี %s สร้าง %s อย่างไม่ถูกต้อง'
	},
	-- การป้องกันขั้นที่สอง! รายชื่อ Object ที่ไม่อนุญาตให้สร้างโดยผู้เล่น (รายชื่อใน blacklist นี้จะถูกเรียกมาตรวจสอบหากการป้องกันหลักไม่สามารถตรวจสอบได้)
	-- ข้อควรระวังในการใส่รายชื่อเข้าใน blacklist คือ ห้าม! ใส่ชื่อ Model ที่สามารถทำลายได้ลงใน List นี้โดยเด็ดขาดเช่น เสาไฟฟ้า ป้ายจราจร เป็นต้น
	blacklist = {
		`dt1_tc_ufo_pivot`,
		`cs1_09_sea_ufo`,
		`sum_prop_dufocore_01a`,
		`dt1_tc_dufo_core`,
		`dt1_tc_dufo_core_lod`,
		`p_spinning_anus_s`,
		`prop_beach_fire`,
		`prop_gas_tank_01a`,
		`prop_cs_dildo_01`,
		`prop_ld_toilet_01`,
		`prop_ld_bomb_anim`,
		`prop_ld_farm_couch01`,
		`ng_proc_box_01a`,
	}
}