-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

Config.IgnoredEvents = {					-- Events ที่ไม่ต้องการให้ Protect (หากทราบว่า Event นั้นๆมีความปลอดภัยอยู่แล้ว แนะนำให้ใส่ในนี้ เพื่อลดการทำงานฝั่ง Server)
	'esx:triggerServerCallback',
	'esx:updateWeaponAmmo',
	'esx:updateCoords',
	'es:updatePositions',
	
	'pma-voice:setTalkingOnRadio',
	'xzero_squad:SV:OnPlayerStatusUpdateReceive',
	'esx:triggerServerCallback',
	-- RECOMMENDED for NC Developer Scripts
	'nc_inventory:updateAmmo',
}