-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

Config.Locale = {
	UI = {
		header = 'เปิดใช้งาน %s',
		current_item_count = 'มีอยู่ %s ชิ้น',
		no_current_item = 'คุณไม่มีสิ่งของชิ้นนี้',
		type_prefix = 'ประเภท',
		type = {
			selection = {
				label = 'เลือก 1 ชิ้น',
				info = 'กรุณาเลือกสิ่งของที่ต้องการ'
			},
			package = {
				label = 'ได้รับทั้งหมด',
				info = 'คุณจะได้รับสิ่งของทั้งหมดตามรายการ'
			},
			gachapon = {
				label = 'สุ่มของที่ได้รับ',
				info = 'สิ่งของที่ได้รับจะสุ่มจากรายการ'
			}
		},
		button = {
			reward = 'รับสิ่งของ',
			cancel = 'ยกเลิก',
			reset = 'เริ่มต้นใหม่',
		},
		to_be_received_count = {
			account = '$%s',
			item = '%s ชิ้น',
			weapon = '1 ชิ้น', -- weapon = 'กระสุน %s',
			vehicle = '1 คัน',
			gachapon = 'สุ่ม 1 อย่าง',
		},
		processing_rewards = 'ระบบกำลังดำเนินการมอบสิ่งของให้',
		reward_list = {
			label = 'สิ่งของที่ได้รับ',
			info = 'ทั้งหมดจะถูกเพิ่มเข้ากระเป๋าโดยอัตโนมัติ'
		},
		owned = 'มีแล้ว',
		owned_all = 'มีครบแล้ว',
	},
}