Config              = {}
Config.DrawDistance = 15
Config.Size         = {x = 1.00, y = 1.00, z = 1.00}
Config.Color        = {r = 255, g = 204, b = 0}
Config.Type         = 29
Config.Locale       = 'en'

Config.Map = {
	{name="Sklep Budowlany",color=59, id=478, x=2747.63, y=3472.85, z=55.67},
	{name="Sklep Budowlany",color=59, id=478, x=46.73, y=-1749.72, z=29.63},
    {name="Stripclub",color=27, id=121,x =132.17, y =-1304.42, z =100.319},
	{name="Yellow Jack",color=27, id=93,x =1992.69, y =3058.57, z =100.319},
	{name="Sklep",color=2, id=52,x =373.875, y =325.896, z =100.319},
	{name="Sklep",color=2, id=52,x =2557.458, y =382.282, z =100.319},
	{name="Sklep",color=2, id=52,x =-3038.939, y =585.954, z =6.908},
	{name="Sklep",color=2, id=52,x =-3241.927, y =1001.462, z =11.830},
	{name="Sklep",color=2, id=52,x =547.431, y =2671.710, z =41.156},
	{name="Sklep",color=2, id=52,x =1961.464, y =3740.672, z =31.343},
	{name="Sklep",color=2, id=52,x =2678.916, y =3280.671, z =54.241},
    {name="Sklep",color=2, id=52,x =1729.216, y =6414.131, z =34.037},
	{name="Alkoholowy",color=51, id=52,x =1135.808, y =-982.281, z =45.415},
	{name="Alkoholowy",color=51, id=52,x =-1222.915, y =-906.983, z =11.326},
	{name="Alkoholowy",color=51, id=52,x =-1487.553, y =-379.107, z =39.163},
	{name="Alkoholowy",color=51, id=52,x =-2968.243, y =390.910, z =14.043},
	{name="Alkoholowy",color=51, id=52,x =1166.024, y =2708.930, z =37.157},
    {name="Alkoholowy",color=51, id=52,x =1392.562, y =3604.648, z =33.980},
	{name="Stacja",color=59, id=361,x =-48.519, y =-1757.514, z =28.421},
	{name="Stacja",color=59, id=361,x =1163.373, y =-323.801, z =68.205},
	{name="Stacja",color=59, id=361,x =-707.501, y =-914.260, z =18.215},
	{name="Stacja",color=59, id=361,x =-1820.523, y =792.518, z =137.118},
    {name="Stacja",color=59, id=361,x =1698.388, y =4924.404, z =41.063},
    {name="Sklep",color=2, id=52,x =25.93, y =-1347.47, z =29.5},
}



Config.Zones = {

	general_shop = { --ร้านขายของตามแมพทั่วไป
		job = nil,
		Items = {},
		isMark= true,
		Pos = {
		-- green shop
			{x = 2556.52,  y = 382.20,  z = 108.62},
			{x = -3040.10, y = 585.62,  z = 7.91},
			{x = -3242.97, y = 1001.38, z = 12.83},
			{x = 547.83,   y = 2670.39, z = 42.16},
			{x = 1960.93,  y = 3741.43, z = 32.34},
			{x = 2678.03,  y = 3281.00, z = 55.24},
			{x = 1729.50,  y = 6415.30, z = 35.04},
			-- {x = 25.86,   y = -1346.50, z = 29.50}, -- งัดร้าน
		-- red shop
			-- {x = 1135.80,  y = -982.28,  z = 46.42}, -- งัดร้าน
			-- {x = -1222.91, y = -906.98,  z = 12.33}, -- งัดร้าน
			-- {x = -1487.55, y = -379.10,  z = 40.16}, -- งัดร้าน
			{x = -2968.16, y = 391.03,   z = 15.04},
			{x = 1165.88,  y = 2709.03,  z = 38.16},
		-- blue shop
			{x = 1392.10,  y = 3604.61,  z = 34.98},
			-- {x = -48.48,   y = -1757.82, z = 29.42}, -- งัดร้าน
			-- {x = 1163.47,  y = -324.00,  z = 69.21}, -- งัดร้าน
			-- {x = -707.42,  y = -914.61,  z = 19.22}, -- งัดร้าน
			{x = -1820.49, y = 792.52,   z = 138.11},
			{x = 1698.02,  y = 4924.67,  z = 42.06},
		}
	},

	garage_shop = { --ร้านขายของตามการาจที่มีตู้ Prop
		job = nil,
		Items = {},
		isMark = false,
		Pos = {
			-- sheep
			{x = 309.560424,  y = -273.349456,  z = 53.931152},
			-- cat
			{x = -275.169220,  y = -903.942872,  z = 31.082764},
			-- deer
			{x = 1030.654908,  y = -768.751648,  z = 58.177246},
			-- bear
			{x = 64.391204,  y = -1575.191162,  z = 29.583130},
			-- tiger
			{x = -1543.608764,  y = -438.250550,  z = 35.581666},
			-- chicken 1
			{x= 222.276916, y= -886.035156, z= 31.217530},
			-- chicken 2
			{x= 131.063736, y= -1081.279174, z= 29.246094},
			-- harbor
			{x= 1225.898926, y= -3327.072510, z= 6.027100},
			-- uptown
			{x= 140.63999938964844, y= 6612.16015625, z= 31.98999977111816},
			-- kayo island
			{x= 4920.16015625, y= -5227.39990234375, z= 2.51999998092651},
			-- circle
			{x= -439.0400085449219, y= 1153.1199951171875, z= 327.1600036621094},
			--afk squid
			{x=-2796.760009765625, y=-1926.6400146484375, z=4.59999990463256},
		}
	},

	police_shop = { --ร้านขายของสำหรับตำรวจและหมอ
		job = "police",
		Items = {},
		isMark= true,
		Pos = {
			{x = 461.0597,  y = -982.2388,  z = 30.6898}, -- Los Santos [PD]
			{x = 1841.4960, y = 3691.1753, z = 34.2670}, -- Sandy Shore [PD]
			{x = -449.8275, y = 6016.3086, z= 31.7164}, -- Paleto Bay [PD]
			{x = 362.1099, y = -1417.7700, z = 32.5099}, -- Los Santos [MD]
			{x = 1829.9188, y = 3677.5508, z = 34.2924}, -- Sandy Shore [MD]
			{x = -259.5329, y = 6309.6182, z = 32.4273}, -- Paleto Bay [MD]
		}
	},

	medic_shop = { -- ร้านขาย bandage AED สำหรับประชาชน
		job = nil,
		Items = {},
		isMark= true,
		Pos = {
			 {x = -435.7099914550781,   y = 1112.1600341796875, z = 327.54998779296875},
		}
	},
	
	beer_shop = { -- ร้านขายเบียและบะหมี่เกี๊ยว
		job = nil,
        Items = {},
		isMark= true,
        Pos = {
			{x = 208.087922, y = -875.182434, z = 31.958984},
			{x = 157.793412, y = -1078.654908, z = 29.414672},
			{x = -1392.7099609375, y = -598.4000244140625, z = 30.31999969482422},
			{x = 1985.030029296875, y = 3050.919921875, z = 47.22000122070312},
        }
    },

	damned_shop = { -- ร้านขายข้าวคนเข้าตู้เอ๋อ
		job = nil,
        Items = {},
		isMark= true,
        Pos = {
			{x = -428.3532, y = 1096.5861, z = 316.3594},
        }
    },


	prisoner_shop = { -- ร้านภายในคุกใหญ่
		job = nil,
		Items = {},
		isMark= true,
		Pos = {
			{x = 1779.510009765625, y = 2589.8701171875, z = 45.79999923706055},
		}
	},

	arena_shop = { -- ร้านขายของสำหรับเทรนนิ่ง
		job = nil,
		Items = {},
		isMark = true,
		Pos = {
			{x = -3747.389892578125, y = -1339.06005859375, z = 906.280029296875}
		}
	},

	gang_shop = { -- ร้านขาย painkiller และ ถุงห่อศพสำหรับแก็ง
		job = nil,
		Items = {},
		isMark = true,
		Pos = {
			{x = -432.19000244140625, y = 1111.1199951171875, z = 327.5799865722656},
		}
	},

	reskin_shop = { -- ร้านขายบัตร reskin
		job = nil,
		Items = {},
		isMark = true,
		Pos = {
			{x = 352.9800109863281, y = -1400.469970703125, z = 32.5099983215332},
		}
	},
}
