-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

---------------------------------------------------
------------------- Client Side -------------------
---------------------------------------------------

-- Function นี้จะถูกเรียกใช้งานเมื่อมีการโหลดข้อมูลครั้งแรก (ในฝั่ง Client)
Config.ClientOnFirstLoaded = function()
	
end

-- Function นี้จะถูกเรียกใช้งานก่อนเปิดใช้งาน Itemset
Config.ClientWillOpenItemset = function(triggeredItem)
	return true
end

-- Function นี้จะถูกเรียกใช้งานเมื่อมี Error
-- errAction จะมี 'receive'
-- errType ที่ถูกส่งมาจะมีอยู่ 1 ชนิดคือ 'error'
-- errText ที่จะถูกส่งมาในรูปแบบต่างๆดังนี้
-- no_more_trigger_items			=>	มีเงินชนิดต่างๆไม่พอสำหรับให้ผู้อื่น
-- no_rewards_received				=>	คุณไม่มีสิ่งของที่จะสามารถได้รับได้
Config.OnError = function(errAction, errType, errText)
	-- error | receive | no_more_trigger_items
	-- error | receive | no_rewards_received
end