-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

---------------------------------------------------
------------------- Client Side -------------------
---------------------------------------------------

-- Function นี้จะถูกเรียกใช้ก่อนจะเปิดกระเป๋า
-- [ storageType: ชนิดของช่องเก็บของยานพาหนะ | plate: ทะเบียนของยานพาหนะ | model: Model Hash ของยานพาหนะ | class: Class ของยานพาหนะ | entity: เลข Entity ของยานพาหนะ ]
Config.ClientWillOpenInventory = function(storageType, plate, model, class, entity)
	local statusDoor = GetVehicleDoorLockStatus(entity)
	if statusDoor > 1 then
		pcall(function()
			exports.nc_notify:PushNotification({
				title = 'ไม่สามารถเปิดท้ายยานพาหนะได้',
				description = string.format('เนื่องจากยานพาหนะ %s สถานะล็อคอยู่', plate),
				type = 'error',
				icon = 'lock',
				duration = 4000
			})
		end)
		return false
	end
	return true		-- true: เมื่อ "ต้องการ" ให้ผู้เล่นสามารถเปิดช่องเก็บของยานพาหนะ(หน้าต่างกระเป๋า)ได้ | false: เมื่อ "ไม่ต้องการ" ให้ผู้เล่นสามารถเปิดช่องเก็บของยานพาหนะ(หน้าต่างกระเป๋า)ได้
end
-- Function นี้จะถูกเรียกใช้เพื่อเปิดกระเป๋า
-- [ storageType: ชนิดของช่องเก็บของยานพาหนะ | plate: ทะเบียนของยานพาหนะ | model: Model Hash ของยานพาหนะ | class: Class ของยานพาหนะ | entity: เลข Entity ของยานพาหนะ ]
-- [ storageItems: สิ่งของต่างๆในช่องเก็บของยานพาหนะ | storageData: ข้อมูลต่างๆของช่องเก็บของยานพาหนะ ]
Config.ClientOpenInventory = function(storageType, plate, model, class, entity, storageItems, storageData)
	-- ตัวอย่างการส่งค่าของ storageItems
	-- storageItems =	{
	-- 					accounts		= ข้อมูล เงินต่างๆ [object],
	-- 					items			= ข้อมูล สิ่งของทั่วไป [object],
	-- 					weapons			= ข้อมูล อาวุธ [object]
	-- 				}

	-- ตัวอย่างการส่งค่าของ storageData
	-- storageData =	{
	-- 					slot			= จำนวนช่องที่ใช้ไป [number],
	-- 					maxSlot			= จำนวนช่องทั้งหมดที่สามารถที่ใช้งานได้ [number],
	-- 					weight			= น้ำหนักของสิ่งของรวมทั้งหมดในช่องเก็บของยานพาหนะ [number],
	-- 					maxWeight		= น้ำหนักสูงสุดที่สามารถเก็บสิ่งของได้ [number],
	-- 					accountsCount	= จำนวน เงินต่างๆ ทั้งหมดที่มีในช่องเก็บของยานพาหนะ [number],
	-- 					itemsCount		= จำนวน สิ่งของทั่วไป ทั้งหมดที่มีในช่องเก็บของยานพาหนะ [number],
	-- 					weaponsCount	= จำนวน อาวุธ ทั้งหมดที่มีในช่องเก็บของยานพาหนะ [number],
	-- 					maxAccountLimit	= จำนวน เงินต่างๆ สูงสุดที่สามารถเก็บได้ในช่องเก็บของยานพาหนะ [number],
	-- 					maxItemLimit	= จำนวน สิ่งของทั่วไป สูงสุดที่สามารถเก็บได้ในช่องเก็บของยานพาหนะ [number],
	-- 					maxWeaponLimit	= จำนวน อาวุธ สูงสุดที่สามารถเก็บได้ในช่องเก็บของยานพาหนะ [number],
	-- 					allowAccounts	= การอนุญาตให้เก็บ เงินต่างๆ [boolean],
	-- 					allowItems		= การอนุญาตให้เก็บ สิ่งของทั่วไป [boolean],
	-- 					allowWeapons	= การอนุญาตให้เก็บ อาวุธ [boolean]
	-- 				}

end

-- Function นี้จะถูกเรียกใช้หลังปิดกระเป๋าสำเร็จ
-- [ storageType: ชนิดของช่องเก็บของยานพาหนะ | plate: ทะเบียนของยานพาหนะ | model: Model Hash ของยานพาหนะ | class: Class ของยานพาหนะ | entity: เลข Entity ของยานพาหนะ ]
Config.ClientClosedInventory = function(storageType, plate, model, class, entity)

end

-- Function นี้จะถูกเรียกเมื่อมีการเปลี่ยนแปลงสิ่งของในช่องเก็บของยานพาหนะเมื่อผู้เล่นเปิดช่องเก็บของยานพาหนะอยู่
-- [ storageType: ชนิดของช่องเก็บของยานพาหนะ | plate: ทะเบียนของยานพาหนะ | model: Model Hash ของยานพาหนะ | class: Class ของยานพาหนะ | entity: เลข Entity ของยานพาหนะ ]
Config.ClientUpdateInventory = function(storageType, plate, model, class, entity, updateData)
	-- updateData =	{
	-- 					itemType	= ชนิดของสิ่งของ account|item|weapon [string],
	-- 					itemName	= ชื่อสิ่งของ [string],
	-- 					itemCount	= จำนวนสิ่งของ/จำนวนกระสุน [number],
	-- 					weaponKey	= Key ของอาวุธ (จะมีค่าเมื่อสิ่งของเป็นอาวุธ) [string],
	-- 					totalCount	= จำนวน สิ่งของ(ตามชนิดของ itemType) ที่มีทั้งหมดในช่องเก็บของยานพาหนะ [number],
	-- 					totalSlot	= จำนวนช่องที่ใช้ไป [number],
	-- 					totalWeight	= น้ำหนักของสิ่งของรวมทั้งหมดในช่องเก็บของยานพาหนะ [number]
	-- 				}

end

-- Function นี้จะถูกเรียกใช้งานเมื่อมี Error
-- errAction จะมี 'open_inventory' => เปิดหน้าต่างกระเป๋า | 'move_item' => เคลื่อนย้ายสิ่งของ
-- และอื่นๆตามชื่อของกระเป๋ารองที่ส่งเข้ามา เช่น 'inside', 'trunk'
-- errType ที่ถูกส่งมาจะมีอยู่ 2 ชนิดคือ 'error' และ 'warning'
-- errText ที่จะถูกส่งมาในรูปแบบต่างๆดังนี้
-- no_vehicle_data					=> 'เปิดหน้าต่างกระเป๋า' - 'ไม่พบข้อมูลยานพาหนะนี้'
-- no_vehicle_config				=> 'เปิดหน้าต่างกระเป๋า' - 'ไม่พบข้อมูลช่องเก็บของยานพาหนะนี้'
-- vehicle_not_found				=> 'เปิดหน้าต่างกระเป๋า' - 'ไม่พบยานพาหนะนี้'
-- different_vehicle_class			=> 'เปิดหน้าต่างกระเป๋า' - 'ตรวจพบชนิดของยานพาหนะที่ไม่ตรงกัน'
-- different_vehicle_model			=> 'เปิดหน้าต่างกระเป๋า' - 'ตรวจพบโมเดลของยานพาหนะที่ไม่ตรงกัน'
-- not_allowed						=> 'เปิดหน้าต่างกระเป๋า' - 'คุณไม่สามารถใช้งานช่องเก็บของยานพาหนะนี้ได้'
-- exceeded_player_limit			=> 'เปิดหน้าต่างกระเป๋า' - 'มีคนใช้งานช่องเก็บของยานพาหนะนี้จำนวนสูงสุดแล้ว'
-- action_too_quick					=> 'เคลื่อนย้ายสิ่งของ' - 'คุณเคลื่อนย้ายสิ่งของเร็วเกินไป'
-- player_account_no_account		=> 'เคลื่อนย้ายสิ่งของ' - 'คุณไม่มีเงินชนิดนี้อยู่ในกระเป๋า'
-- player_account_exceed_weight		=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บเงินชนิดนี้'
-- player_item_no_item				=> 'เคลื่อนย้ายสิ่งของ' - 'คุณไม่มีของสิ่งนี้อยู่ในกระเป๋า'
-- player_item_exceed_limit			=> 'เคลื่อนย้ายสิ่งของ' - 'พื้นที่ในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บของสิ่งนี้'
-- player_item_exceed_weight		=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บของสิ่งนี้'
-- player_weapon_no_weapon			=> 'เคลื่อนย้ายสิ่งของ' - 'คุณไม่มีอาวุธชิ้นนี้อยู่ในกระเป๋า'
-- player_weapon_exceed_weight		=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บอาวุธชิ้นนี้'
-- player_weapon_already_have		=> 'เคลื่อนย้ายสิ่งของ' - 'คุณมีอาวุธชนิดนี้อยู่ในกระเป๋าอยู่แล้ว'
-- storage_account_blacklist		=> 'เคลื่อนย้ายสิ่งของ' - 'เงินชนิดนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
-- storage_account_exceed_slot		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บเงินชนิดนี้เพิ่ม'
-- storage_account_exceed_limit		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บเงินเพิ่มได้อีก'
-- storage_account_exceed_weight	=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักของเงินมากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
-- storage_account_not_allow		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บเงินได้'
-- storage_item_blacklist			=> 'เคลื่อนย้ายสิ่งของ' - 'ของสิ่งนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
-- storage_item_exceed_slot			=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บสิ่งของชนิดนี้เพิ่ม'
-- storage_item_exceed_limit		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บสิ่งของชิ้นนี้เพิ่มได้อีก'
-- storage_item_exceed_weight		=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักของสิ่งของมากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
-- storage_item_not_allow			=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บสิ่งของทั่วไปได้'
-- storage_weapon_blacklist			=> 'เคลื่อนย้ายสิ่งของ' - 'อาวุธชนิดนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
-- storage_weapon_exceed_slot		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บอาวุธชนิดนี้เพิ่ม'
-- storage_weapon_exceed_limit		=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บอาวุธเพิ่มได้อีก'
-- storage_weapon_exceed_weight		=> 'เคลื่อนย้ายสิ่งของ' - 'น้ำหนักของอาวุธชิ้นนี้มากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
-- storage_weapon_not_allow			=> 'เคลื่อนย้ายสิ่งของ' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บอาวุธได้'
Config.ClientNotificationError = function(errAction, errType, errText, itemName)
	-- ตัวอย่างการเขียน Notification ต่างๆ
	-- no_vehicle_data					=> 'error' - 'ไม่พบข้อมูลยานพาหนะนี้'
	-- no_vehicle_config				=> 'error' - 'ไม่พบข้อมูลช่องเก็บของยานพาหนะนี้'
	-- vehicle_not_found				=> 'error' - 'ไม่พบยานพาหนะนี้'
	-- different_vehicle_class			=> 'error' - 'ตรวจพบชนิดของยานพาหนะที่ไม่ตรงกัน'
	-- different_vehicle_model			=> 'error' - 'ตรวจพบโมเดลของยานพาหนะที่ไม่ตรงกัน'
	-- not_allowed						=> 'error' - 'คุณไม่สามารถใช้งานช่องเก็บของยานพาหนะนี้ได้'
	-- exceeded_player_limit			=> 'error' - 'มีคนใช้งานช่องเก็บของยานพาหนะนี้จำนวนสูงสุดแล้ว'
	-- action_too_quick					=> 'warning' - 'คุณเคลื่อนย้ายสิ่งของเร็วเกินไป'
	-- player_account_no_account		=> 'error' - 'คุณไม่มีเงินชนิดนี้อยู่ในกระเป๋า'
	-- player_account_exceed_weight		=> 'error' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บเงินชนิดนี้'
	-- player_item_no_item				=> 'error' - 'คุณไม่มีของสิ่งนี้อยู่ในกระเป๋า'
	-- player_item_exceed_limit			=> 'error' - 'พื้นที่ในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บของสิ่งนี้'
	-- player_item_exceed_weight		=> 'error' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บของสิ่งนี้'
	-- player_weapon_no_weapon			=> 'error' - 'คุณไม่มีอาวุธชิ้นนี้อยู่ในกระเป๋า'
	-- player_weapon_exceed_weight		=> 'error' - 'น้ำหนักในกระเป๋าของคุณไม่เพียงพอสำหรับเก็บอาวุธชิ้นนี้'
	-- player_weapon_already_have		=> 'error' - 'คุณมีอาวุธชนิดนี้อยู่ในกระเป๋าอยู่แล้ว'
	-- storage_account_blacklist		=> 'error' - 'เงินชนิดนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
	-- storage_account_exceed_slot		=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บเงินชนิดนี้เพิ่ม'
	-- storage_account_exceed_limit		=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บเงินเพิ่มได้อีก'
	-- storage_account_exceed_weight	=> 'error' - 'น้ำหนักของเงินมากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
	-- storage_account_not_allow		=> 'error' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บเงินได้'
	-- storage_item_blacklist			=> 'error' - 'ของสิ่งนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
	-- storage_item_exceed_slot			=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บสิ่งของชนิดนี้เพิ่ม'
	-- storage_item_exceed_limit		=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บสิ่งของชิ้นนี้เพิ่มได้อีก'
	-- storage_item_exceed_weight		=> 'error' - 'น้ำหนักของสิ่งของมากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
	-- storage_item_not_allow			=> 'error' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บสิ่งของทั่วไปได้'
	-- storage_weapon_blacklist			=> 'error' - 'อาวุธชนิดนี้ไม่สามารถเก็บในช่องเก็บของยานพาหนะนี้ได้'
	-- storage_weapon_exceed_slot		=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีช่องไม่พอสำหรับเก็บอาวุธชนิดนี้เพิ่ม'
	-- storage_weapon_exceed_limit		=> 'error' - 'ช่องเก็บของยานพาหนะนี้มีที่ว่างไม่พอสำหรับเก็บอาวุธเพิ่มได้อีก'
	-- storage_weapon_exceed_weight		=> 'error' - 'น้ำหนักของอาวุธชิ้นนี้มากเกินไปสำหรับเก็บในช่องเก็บของยานพาหนะนี้'
	-- storage_weapon_not_allow			=> 'error' - 'ช่องเก็บของยานพาหนะนี้ไม่อนุญาตให้เก็บอาวุธได้'
	
end