-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

-- เปิดใช้งานระบบรายละเอียดสิ่งของ
Config.EnableItemDescriptions = true

-- ชื่อหมวดหมู่สิ่งของต่างๆที่ไม่ได้อยู่ใน Filter (หากไม่ได้ตั้งค่า จะมีค่าเป็น "ทั่วไป")
Config.ItemCategoryDefaultIfNotInFilters = {
	-- item = 'สิ่งของ',
	account = 'การเงิน',
	key = 'กุญแจ',
	accessory = 'เครื่องแต่งกาย',
	weapon = 'อาวุธ',

	personal = 'ส่วนตัว'
}

-- Custom หมวดหมู่ของสิ่งของตามชนิด (เพิ่ม)
Config.CustomItemCategories = {
	item = {
		['apple'] = { 'งานขาว' },
		['cement'] = { 'งานดำ' },
		['wire'] = { 'งานดำ' },
	},
	account = {
		['black_money'] = { '' }
	},
	key = {

	},
	weapon = {
		['WEAPON_BAT'] = { 'Tier 1' },
		['WEAPON_POOLCUE'] = { 'Tier 1' },
		['WEAPON_GOLFCLUB'] = { 'Tier 1' },
	},
	accessory = {

	}
}

-- รายละเอียดเริ่มต้นของสิ่งของชนิดต่างๆ
Config.DefaultItemDescriptions = {
	item = 'สิ่งของทั่วไปในประเทศ บางอย่างอาจจะมีค่ามากหรือค่าน้อย อยู่ที่คุณพิจารณา',
	account = 'Test TEST<banner>Hello World</banner><banner>Hello World</banner>Test<banner>Hello World</banner>',
	key = '',
	vehicle_key = '',
	house_key = '',
	accessory = '',
	weapon = 'อุปกรณ์นี้ สามารถใช้ทำร้ายผู้เล่นได้ ดังนั้น ห้ามใช้งานมั่ว หากผิดกฎ มีใบเหลืองแน่นอน',
	personal = '',
}

-- รายละเอียดของสิ่งของต่างๆ
Config.ItemDescriptions = {
	item = {
	-- business
		['card_reskin'] = 'กดใช้เพื่อศัลยกรรม\n* หากกดใช้แล้วไอเทมจะถูกลบ โปรดระมัดระวังในการใช้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['card_lastname'] = 'กดใช้เพื่อเปลี่ยนนามสกุล\n* หากกดใช้แล้วไอเทมจะถูกลบ โปรดระมัดระวังในการใช้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['auto_1h'] = 'ช่วยให้คุณสามารถนั่งถอดจิตฟาร์มอัตโนมัติโดยไม่ต้องออกจากเกม เหมาะสำหรับเวลาที่คุณต้องการพักหรือทำธุระส่วนตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['gum_eco'] = 'ทำให้ได้รับไอเทมงาน Economy เป็นสองเท่า ทั้งขั้นตอนเก็บและขั้นตอนแปรรูป\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กด F10 เพื่อซื้อ',
		['gum_mining'] = 'ทำให้ได้รับไอเทมงานเหมืองเป็นสองเท่า ทั้งขั้นตอนเก็บและขั้นตอนแปรรูป\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สามารถได้รับจากการคราฟ และ รวมกับอุปกรณ์ที่ใช้ความยากลำบากในการหา',
		['card_vip'] = 'ให้สิทธิพิเศษแก่ผู้ถือบัตรแบบ VIP\n\n- ขายไอเทม Economy ได้เงินเพิ่ม 20$\n- ลดระยะเวลาทำงานลง 20%\n- เพิ่มน้ำหนักกระเป๋า 30KG\n- สิทธิตั้งร้านค้าด้วย NPC\n- สิทธิเก็บของในเต็นท์ 1000 ชิ้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['card_vault'] = 'สามารถสร้างตู้เซฟใหม่เพิ่ม (จำกัดสูงสุด 2 ตู้)\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['exp_vault'] = 'สำหรับการอัพเกรดตู้เซฟ\n\n- 5 EXP\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โอกาสได้รับจากการทำเควสหรือซื้อได้ที่ CASH SHOP (F10)',
		['cron'] = 'ทำให้ผู้เล่นไม่สูญเสียวัสดุในการใช้คราฟอาวุธ หากคราฟติดโอกาสไม่สำเร็จ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',		
		['heart_100'] = 'หากอัพเกรดอาวุธไม่สำเร็จ จะทำให้อาวุธไม่ถูกลดขั้น\n\n- ป้องกันการลดขั้น 100%\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป หมวดหมู่ : วัสดุ หรือ CASH SHOP (F10)',
		['rental_3d'] = 'รถ Supercar น้ำหนัก 300KG\n\n- ระยะเวลา 3 วัน \n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['rental_7d'] = 'รถ Supercar น้ำหนัก 300KG\n\n- ระยะเวลา 7 วัน \n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['rental_15d'] = 'รถ Supercar น้ำหนัก 300KG\n\n- ระยะเวลา 15 วัน \n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['gacha_5'] = 'กาชาปองสำหรับฟื้นฟูทรัพยากรต่าง ๆ เหมาะสำหรับหลังต้องพบเจอกับศึกหนัก\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- CASH SHOP (F10)',
		['gacha_5_1'] = 'กาชาปองสำหรับฟื้นฟูเงิน หากการเงินมีปัญหา ปรึกษากาชาปองฟื้นฟู\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปองฟื้นฟู ใน CASH SHOP (F10)',		
		['gacha_5_2'] = 'กาชาปองสำหรับฟื้นฟูทั่วไป หากตามหาบางสิ่งอยู่ ที่กาชาปองฟื้นฟูมีให้ท่าน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปองฟื้นฟู ใน CASH SHOP (F10)',		
		['gacha_5_3'] = 'กาชาปองสำหรับฟื้นฟูทรัพยากร หากของที่ต้องการไม่เพียงพอ ลองมองมาที่กาชาปองฟื้นฟู\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปองฟื้นฟู ใน CASH SHOP (F10)',		
		['gacha_5_4'] = 'กาชาปองสำหรับฟื้นฟูพิเศษ หากอาวุธหายหรือขาดวัสดุในการตี ที่กาชาปองฟื้นฟูมีให้เสมอ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปองฟื้นฟู ใน CASH SHOP (F10)',
		['box_exp'] = 'กล่องสุ่มรับ EXP จำนวน 5 - 15 ใบ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปองฟื้นฟู ใน CASH SHOP (F10)',
	-- admin
		['ad_blessing'] = 'เครื่องมือเทพเจ้า ลองกดใช้ดิ มึงเป็นแอดมินอย่าโง่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',			
		['ad_bell'] = 'เครื่องมือเทพเจ้า ลองกดใช้ดิ มึงเป็นแอดมินอย่าโง่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',		
		['ad_clipper'] = 'ว้าย ! หัวล้าน เป็นเวลา 5 นาที\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',	
		['ad_spray'] = 'เอาชอล์กมาวงเร็ว ! มีคนกลายเป็นไอ้มืด 5 นาที\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',
		['vault_master'] = 'เครื่องมือเทพเจ้า ลองกดใช้ดิ มึงเป็นแอดมินอย่าโง่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',	
		['ad_bag'] = 'เครื่องมือเทพเจ้า ลองกดใช้ดิ มึงเป็นแอดมินอย่าโง่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสกเอาดิวะกระบือ',	
		['busker'] = 'สำหรับนักร้องริมทาง หรือ ตามจุดที่ผู้คนมากมาย เพื่อให้ผู้คนได้สนับสนุนเสียงอันไพเราะโดยการให้ทิปในหมวก\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ผ่านการคัดเลือกจากทีมงาน',
	-- benefit
		['starter_kit'] = 'กล่องสวัสดิการเริ่มต้นผู้เล่นใหม่ กดใช้เพื่อรับไอเทมภายในกล่อง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',	
		['box_rcar'] = 'กล่องสุ่มรถ Supercar สวัสดิการเริ่มต้นผู้เล่นใหม่ กดใช้เพื่อสุ่มรถ Supercar ระยะเวลา 7 วัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',	
		['gacha_support'] = 'กาชาปองสนับสนุนสวัสดิการเริ่มต้นผู้เล่นใหม่ กดใช้เพื่อรับไอเทมภายในกล่อง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',	
		['gacha_event'] = 'กาชาปองสำหรับผู้ที่เข้าร่วมกิจกรรมของทางประเทศ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ของรางวัลกิจกรรมประเทศ',
		['fashion_0'] = 'กล่องสุ่มแฟชั่นสวัสดิการผู้เล่นใหม่ กดใช้เพื่อสุ่มรับแฟชั่นสุดพิเศษ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
	-- fashion
		['baby1'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby2'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby3'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby4'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby5'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby6'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby7'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['baby8'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่น',
		['spacpup'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['spacpupb'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['spacpupc'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['spacpupd'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['spacpupe'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['spacpupf'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute1'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute2'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute3'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute4'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute5'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
		['summersocute6'] = 'ชอบก็จัด ประหยัดทำไม กดใช้เพื่อสวมใส่แฟชั่น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแฟชั่น หมวดหมู่ : แฟชั่น',
	-- economy
		['chicken_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ นำไปแปรรูปเพื่อขายในราคาที่สูงขึ้นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มไก่',
		['chicken_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ ส่วนประกอบในการทำอาหาร\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปไก่',
		['pork_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ นำไปแปรรูปเพื่อขายในราคาที่สูงขึ้นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มหมู',
		['pork_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ ส่วนประกอบในการทำอาหาร\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปหมู',	
		['rice_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ นำไปแปรรูปเพื่อขายในราคาที่สูงขึ้นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มข้าว',
		['rice_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ ส่วนประกอบในการทำอาหาร\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปข้าว',	
		['cabbage_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ นำไปแปรรูปเพื่อขายในราคาที่สูงขึ้นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มกะหล่ำ',
		['cabbage_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ ส่วนประกอบในการทำอาหาร\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปกะหล่ำ',
		['milk_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ นำไปแปรรูปเพื่อขายในราคาที่สูงขึ้นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มนม',
		['milk_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด หรือ ส่วนประกอบในการทำอาหาร\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปนม',
		['fish_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดตกปลา',
		['fish_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดตกปลา',
		['fish_3'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดตกปลา',
		['hunt_1'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดล่าสัตว์ เกาะ Cayo',
		['hunt_2'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดล่าสัตว์ เกาะ Cayo',
		['hunt_3'] = 'ไอเทม Economy สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดล่าสัตว์ เกาะ Cayo',
	-- economy afk
		['afk_squid'] = 'ไอเทม AFK สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ตกหมึก (AFK)',
		['afk_gem'] = 'ไอเทม AFK สามารถนำไปขายในตลาด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- นั่งฌาณ (AFK)',
	-- mining
		['copper_1'] = 'ไอเทมงานเหมือง สามารถนำไปแปรรูปเพื่อใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เหมืองทองแดง',
		['copper_2'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปทองแดง',
		['sulfer'] = 'ส่วนผสมสำคัญในการคราฟกระสุน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปทองแดง',
		['steel_1'] = 'ไอเทมงานเหมือง สามารถนำไปแปรรูปเพื่อใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เหมืองเหล็ก',
		['steel_2'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปเหล็ก',
		['steel_3'] = 'ส่วนผสมของการทำอัลลอย วัสดุสำคัญในการคราฟอาวุธ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปเหล็ก',
		['gold_1'] = 'ไอเทมงานเหมือง สามารถนำไปแปรรูปเพื่อใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เหมืองทอง',
		['gold_2'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปทอง',
		['wood_1'] = 'ไอเทมงานเหมือง สามารถนำไปแปรรูปเพื่อใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เหมืองไม้',
		['wood_2'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปไม้',
		['coal'] = 'ส่วนผสมสำคัญในการคราฟกระสุน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปไม้',
		['crystal'] = 'ไอเทมงานเหมือง สามารถนำไปแปรรูปเพื่อใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เหมืองคริสตัล',
		['diamond'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปคริสตัล',
		['ruby'] = 'ไอเทมงานเหมือง สามารถใช้เป็นวัสดุในการคราฟไอเทมต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปคริสตัล',
		['weed'] = 'ดอกกัญชา สามารถนำไปแปรรูปเพื่อใช้เป็นไอเทมสำหรับคลายเครียด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดฟาร์มกัญชา',
		['weed_pack'] = 'ไอเทมสำหรับคลายเครียด สามารถใช้เสพได้ทุกที่ในประเทศ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปกัญชา',
	-- bonus
		['bonus_eco'] = 'ไอเทมโบนัส Economy ที่มีราคาขายในตลาดสูง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งานประเภท Economy (ฟาร์ม)',
		['bonus_mining'] = 'ไอเทมโบนัส Mining ที่มีราคาขายในตลาดสูง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งานประเภท Mining (เหมืองแร่)',
	-- agency
		['vault_md'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ผบ. / ผอ. หน่วยงาน หรือ ร้านค้าหน่วยงาน',
		['medkit'] = 'ไอเทมสำหรับใช้ช่วยชีวิตผู้เล่นที่หมดสติ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['vault_pd'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ผบ. / ผอ. หน่วยงาน หรือ ร้านค้าหน่วยงาน',
		['card_gang'] = 'บัตรที่ใช้ยืนยันในการเป็นสมาชิกและสิทธิในการรับสวัสดิการของแก๊ง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- การลงทะเบียนแก๊งกับทีมงาน',
		['card_family'] = 'บัตรที่ใช้ยืนยันในการเป็นสมาชิกและสิทธิในการรับสวัสดิการของครอบครัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- การลงทะเบียนครอบครัวกับทีมงาน',
		['megaphone'] = 'ไอเทมสำหรับขยายความกว้างของเสียงที่พูด เหมาะสำหรับการประกาศหรือสั่งการ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เช่ายืมกับทีมงาน',
		['coin_killer'] = 'ใช้เป็นสกุลเงินใช้แลกเปลี่ยนหรือสิ่งแสดงที่แสดงความเป็นฆาตรกรของคุณ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ของรางวัลฆาตรกร',
		['gov_toolkit'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['gov_aed'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['gov_radio'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['gov_scuba'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['gov_vest'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['gov_tablet'] = 'ไอเทมสำหรับใช้ภายในหน่วยงานเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
	-- illegal
		['cement'] = 'วัสดุสำคัญในการใช้คราฟอาวุธ\n\n* ไอเทมผิดกฏหมาย หากมีครอบครองไว้ในตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กองปูน',
		['amp_b'] = 'ส่วนประกอบสำคัญในการใช้ทำยาเสพติด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดยาแอมป์',
		['amp_g'] = 'ส่วนประกอบสำคัญในการใช้ทำยาเสพติด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งานตกปลา และ งานล่าสัตว์',
		['amp_r'] = 'ส่วนประกอบสำคัญในการใช้ทำยาเสพติด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดยาแอมป์',
		['keycard_silver'] = 'ไอเทมสำคัญในการใช้งัดบ้าน คีย์การ์ดแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['keycard_gold'] = 'ไอเทมสำคัญในการใช้งัดบ้าน คีย์การ์ดแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['keycard_red'] = 'ไอเทมสำคัญในการใช้งัดบ้าน คีย์การ์ดแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['house_silver'] = 'กุญแจสำหรับการไขตู้เซฟในบ้าน กุญแจแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['house_gold'] = 'กุญแจสำหรับการไขตู้เซฟในบ้าน กุญแจแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['house_red'] = 'กุญแจสำหรับการไขตู้เซฟในบ้าน กุญแจแต่ละสีมีโอกาสได้รับไอเทมที่ต่างกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['cocaine_1'] = 'สามารถนำไปแปรรูปเพื่อใช้สำหรับขายหรือเสพคลายเครียด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดเก็บสารตั้งต้น',
		['cocaine_2'] = 'ไอเทมสำหรับขายเพื่อให้ได้รับเงินผิดกฏหมายหรือใช้เสพคลายเครียด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปโคเคน',
		['meth'] = 'สามารถนำไปแปรรูปเพื่อใช้สำหรับขาย\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดเก็บสารตั้งต้น',
		['meth_a'] = 'ไอเทมสำหรับขายเพื่อให้ได้รับเงินผิดกฏหมาย\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแปรรูปยาไอซ์',
		['meth_b'] = 'ไอเทมสำหรับขายเพื่อให้ได้รับเงินผิดกฏหมาย\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',
		['heroine'] = 'ไอเทมสำหรับขายเพื่อให้ได้รับเงินผิดกฏหมาย\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',
	-- shop
		['Phone'] = 'เครื่องมือสื่อสารที่ใช้ติดต่อบุคคลอื่น ๆ และเข้าถึงแอปพลิเคชันต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['skateboard'] = 'อุปกรณ์ทุ่นแรงสำหรับการเดินทางหรือเล่นผาดโผน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['veh_towel'] = 'เครื่องมือเช็ดยานพาหนะให้เงางามเหมือนใหม่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['toolkit'] = 'อุปกรณ์สำหรับการซ่อมแซมยานพาหนะ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป หมวดหมู่ : อุปกรณ์ หรือ ร้านค้าทั่วไป',
		['card_transfer'] = 'ใช้สำหรับการโอนย้ายสิทธิ์ในยานพาหนะ จำเป็นต้องมีบัตรทั้งผู้โอนและผู้รับโอน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['veh_towel'] = 'เครื่องมือเช็ดยานพาหนะให้เงางามเหมือนใหม่\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['card_booth'] = 'อนุญาตให้ผู้เล่นตั้งร้านค้าของตนเองในพื้นที่ที่กำหนด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['card_afk'] = 'ช่วยให้คุณสามารถยืนถอดจิตตกปลาหมึกอัตโนมัติโดยไม่ต้องออกจากเกม เหมาะสำหรับเวลาที่คุณต้องการพักหรือทำธุระส่วนตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['condiment'] = 'ส่วนประกอบสำคัญสำหรับการปรุงอาหารเพื่อเพิ่มรสชาติให้กับเมนูต่าง ๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['work_kit'] = 'อุปกรณ์สำหรับการทำงานต่าง ๆ ไม่ว่าจะเป็นงาน Economy หรืองานขุดเหมือง\n\n- อุปกรณ์มีโอกาสแตก\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['fishing_bait'] = 'เหยื่อสำหรับการทำงานตกปลา\n\n- ใช้เหยื่อ 1 ตัวต่อการตกปลา 1 ครั้ง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['fishing_rod'] = 'อุปกรณ์สำหรับการทำงานต่าง ๆ ไม่ว่าจะเป็นงาน Economy หรืองานขุดเหมือง\n\n- อุปกรณ์มีโอกาสแตก\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['snow_gloves'] = 'ถุงมือสำหรับเก็บหิมะ\n\n- เก็บได้เฉพาะในพื้นที่ที่มีหิมะเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['hifi'] = 'ลำโพงเครื่องเสียงสำหรับเปิดฟังคลายเหงา\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',
		['rose_1'] = 'สิ่งของแทนใจเพื่อมอบให้กับคนรักหรือคนรู้ใจ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',	
		['rose_2'] = 'สิ่งของแทนใจเพื่อมอบให้กับคนรักหรือคนรู้ใจ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าทั่วไป',	
	-- gang shop
		['body_bag'] = 'ใช้สำหรับห่อศพและขนย้ายศพ เพื่อให้ผู้ที่ถูกห่อศพเสียชีวิตหลังจากครบระยะเวลาที่กำหนด\n\n- เฉพาะผู้ที่มีบัตรแก๊งหรือบัตรครอบครัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าสำหรับแก๊งและครอบครัว',	
		['painkiller'] = 'ยาสำหรับรักษาบาดแผล ช่วยให้คุณรู้สึกดีขึ้นปานกลาง\n\n- เฉพาะผู้ที่มีบัตรแก๊งหรือบัตรครอบครัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าสำหรับแก๊งและครอบครัว',	
	-- hospital shop
		['aed'] = 'เครื่องกระตุ้นหัวใจฉุกเฉินสำหรับใช้ในการช่วยชีวิตผู้ที่มีอาการหัวใจหยุดเต้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าโรงพยาบาล',
		['bandage'] = 'ใช้สำหรับรักษาบาดแผล ช่วยให้คุณรู้สึกดีขึ้นเล็กน้อย\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าปฐมพยาบาล',
	-- general
		['player_mask'] = 'หน้ากากสำหรับสวมใส่เพื่อปิดบังใบหน้า\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านหน้ากาก',
		['card_nplayer'] = 'ให้สิทธิพิเศษแก่ผู้เล่นใหม่\n\n- ลดระยะเวลาทำงานลง 50%\n- ป้องกันการถูกปล้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่นใหม่',
		['vault_key'] = 'กุญแจสำหรับใช้เปิดตู้เซฟส่วนตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- สวัสดิการผู้เล่นใหม่',	
		['casino_chip'] = 'ใช้เป็นสกุลเงินภายในคาสิโน สำหรับการเล่นเกมหรือเดิมพัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- จุดแลกชิปคาสิโน',	
		['exp'] = 'ค่าประสบการณ์การดำรงชีวิตในประเทศ ไอเทมสำคัญสำหรับหลาย ๆ อย่าง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ออนไลน์, การทำงาน หรือ กิจกรรมต่าง ๆ',	
		['exp_gang'] = 'ค่าประสบการณ์การดำรงชีวิตในประเทศ ใช้แลกเปลี่ยนไอเทมสำหรับแก๊ง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ออนไลน์, การทำงานผิดกฏหมาย หรือ กิจกรรมต่าง ๆ',	
	-- meal
		['noodle'] = 'สำหรับฟื้นฟูหลอดอาหาร\n\n- อาหาร 100\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านอาหาร',	
		['beer'] = 'สำหรับลดความเครียด คลายความเหงา\n\n- ลดความเครียด 20\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านอาหาร หรือ ผับ',	
		['meal_1'] = 'สำหรับฟื้นฟูหลอดสถานะต่าง ๆ\n\n- อาหาร 100\n- ลดความเครียด 25\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาหาร',
		['meal_2'] = 'สำหรับฟื้นฟูหลอดอาหาร\n\n- อาหาร 100\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาหาร',
		['meal_3'] = 'สำหรับฟื้นฟูหลอดสถานะต่าง ๆ\n\n- อาหาร 10\n- ลดความเครียด 30\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาหาร',
		['meal_mre'] = 'ชุดอาหารพิเศษพร้อมรับประทาน\n\n- อาหาร 100\n- ลดความเครียด 100\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- กาชาปอง หรือ กิจกรรมต่าง ๆ',
	-- craft
		['scuba'] = 'ใช้ในการดำน้ำได้นานถึง 3 นาที\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['GADGET_PARACHUTE'] = 'ใช้สำหรับการกระโดดจากที่สูง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['lockpick'] = 'ใช้สำหรับปลดล็อคกุญแจมือ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['vest'] = 'เกราะเสริมความแกร่งช่วยป้องกัน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['helmet'] = 'สามารถกันทุกสิ่งที่กระทบกับส่วนหัวโดยที่ไม่เกิดความเสียหายต่อร่างกายได้ 1 ครั้ง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['alloy'] = 'วัสดุสำคัญในการใช้คราฟอาวุธขั้นสูง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['heart_90'] = 'หากอัพเกรดอาวุธไม่สำเร็จ จะทำให้อาวุธไม่ถูกลดขั้น\n\n- ป้องกันการลดขั้น 90%\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['heart_70'] = 'หากอัพเกรดอาวุธไม่สำเร็จ จะทำให้อาวุธไม่ถูกลดขั้น\n\n- ป้องกันการลดขั้น 70%\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['screwdv'] = 'อุปกรณ์สำคัญที่ใช้สำหรับการงัดร้านค้า\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['screwdv_broken'] = 'ไขควงชำรุด สามารถสะสมเพื่อนำไปซ่อมแซมได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดร้านค้า',
		['disruptor'] = 'อุปกรณ์สำคัญในการใช้ตัดสัญญาณแหกคุก\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['key_gang'] = 'กุญแจสำหรับการเข้าถึงการคราฟไอเทมสำหรับแก๊งและครอบครัวเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',
		['radio_board'] = 'แผงวงจรวิทยุสื่อสารชำรุด สามารถสะสมเพื่อนำไปซ่อมแซมได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- เสียชีวิต(ห่อศพ)',
		['radio'] = 'วิทยุสำหรับใช้ในการสื่อสารกับผู้อื่นในระยะไกล\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',		
		['adrenaline'] = 'ยากระตุ้นที่ทำให้ผู้ใช้เลือดสูบฉีด มีสถานะวิ่งรวดเร็วชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',	
		['tag_gang'] = 'ตราสำหรับการลงทะเบียนแก๊ง หรือ ครอบครัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟแก๊ง',
		['gun_pin'] = 'วัสดุสำคัญในการคราฟส่วนประกอบปืน Cylinder\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดบ้าน',
		['gun_barrel'] = 'วัสดุสำคัญในการคราฟส่วนประกอบปืน Grip\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดบ้าน',
		['gun_spring'] = 'วัสดุสำคัญในการคราฟส่วนประกอบปืน Trigger\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดบ้าน',
		['revolver_1'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['revolver_2'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['revolver_3'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['gun_screw'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['gun_mold'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['gun_sight'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['gun_permit'] = 'วัสดุสำคัญในการคราฟอาวุธประเภทปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['bullet'] = 'ใช้เป็นวัสดุในการคราฟ Speed Loader เพื่อใช้บรรจุกระสุนปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
		['speed_loader'] = 'สำหรับเพิ่มกระสุนทีละ 6 นัดในอาวุธปืน\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',	
	},
	account = {
		['money'] = 'หน่วยเงินที่ใช้ภายในประเทศ สามารถใช้จ่ายกับการซื้อสินค้า, สิ่งของอำนวยความสะดวก, ยานพาหนะ, และการบริการอื่นๆ',
		['bank'] = '',
		['black_money'] = 'หน่วยเงินผิดภฎหมาย ใช้เป็นค่าใช้จ่ายในการคราฟอาวุธและของแกงค์\n* สามารถโดนข้อหาจากตำรวจได้ หากมีครอบครองไว้ในตัว'
	},
	key = {
		['vehicle_key'] = 'กุญแจสำหรับยานพาหนะส่วนตัว ใช้เพื่อล็อคและปลดล็อครถ\n* หากต้องการโอนสิทธิยานพาหนะ จะต้องใช้ <rarity-0>บัตรโอนรถ</rarity-0> เพื่อดำเนินการ',
		['house_key'] = ''
	},
	weapon = {
		-- Common (0)
			-- general
		['WEAPON_SNOWBALL'] = 'ใช้เพื่อสร้างความสนุกสนานในการต่อสู้หรือเล่นเกม ไม่ได้มีความเสียหายสูงแต่สามารถใช้รบกวนคู่ต่อสู้ได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ใช้ถุงมือหิมะในพื้นที่ที่มีหิมะ',
		['WEAPON_FLASHLIGHT'] = 'ใช้เพื่อสร้างความสนุกสนานและการฉายแสงไฟเท่านั้น ไม่สามารถใช้ในการต่อสู้ได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟทั่วไป',
			-- rental
		['R_WEAPON_BAT'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_BOTTLE'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_DAGGER'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_GOLFCLUB'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_KNIFE'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_KNUCKLE'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_MACHETE'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
		['R_WEAPON_POOLCUE'] = 'อาวุธเช่าสำหรับการฝึกฝนการใช้อาวุธและสกิลการต่อสู้ใน Training Arena เท่านั้น',
			-- tier 1
		['WEAPON_BAT_1H'] = 'ไม้เบสบอล Tier 1\n- Damage : 10\n- ประเภท : อาวุธมือเดียว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_GOLFCLUB_1H'] = 'ไม้กอล์ฟ Tier 1\n- Damage : 10\n- ประเภท : อาวุธมือเดียว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNUCKLE'] = 'สนับมือ Tier 1\n- Damage : 7\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			
		-- Uncommon (1)
			-- tier 1
		['WEAPON_BAT_1H_2'] = 'ไม้เบสบอล Tier 1 อัพเกรดขั้นที่ 2\n- Damage : 12\n- ประเภท : อาวุธมือเดียว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_GOLFCLUB_1H_2'] = 'ไม้กอล์ฟ Tier 1 อัพเกรดขั้นที่ 2\n- Damage : 12\n- ประเภท : อาวุธมือเดียว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNUCKLE_2'] = 'สนับมือ Tier 1 อัพเกรดขั้นที่ 2\n- Damage : 9\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 2
		['WEAPON_BOTTLE'] = 'ปากฉลาม Tier 2\n- Damage : 18\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_MACHETE'] = 'มาเชเต้ Tier 2\n- Damage : 19\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
	
		-- Rare (2)
			-- tier 1
		['WEAPON_BAT'] = 'ไม้เบสบอล Tier 1 อัพเกรดขั้นที่ 3\n- Damage : 14\n- ประเภท : อาวุธสองมือ\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_GOLFCLUB'] = 'ไม้กอล์ฟ Tier 1 อัพเกรดขั้นที่ 3\n- Damage : 14\n- ประเภท : อาวุธสองมือ\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNUCKLE_3'] = 'สนับมือ Tier 1 อัพเกรดขั้นที่ 3\n- Damage : 11\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 2
		['WEAPON_BOTTLE_2'] = 'ปากฉลาม Tier 2 อัพเกรดขั้นที่ 2\n- Damage : 21\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_MACHETE_2'] = 'มาเชเต้ Tier 2 อัพเกรดขั้นที่ 2\n- Damage : 23\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 3
		['WEAPON_DAGGER'] = 'Dagger Tier 3\n- Damage : 26\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNIFE'] = 'Knife Tier 3\n- Damage : 26\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_POOLCUE'] = 'ไม้พูล Tier 3\n- Damage : 18\n- ประเภท : อาวุธสองมือ\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_REVOLVER'] = 'Revolver Mk.1\n- Damage : 1\n- เอฟเฟค : ทำให้ผู้ถูกยิงติดสถานะสตั้นชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
	
		-- Epic (3)
			-- tier 1
		['WEAPON_KNUCKLE_4'] = 'สนับมือ Tier 1 อัพเกรดขั้นที่ 4\n- Damage : 14\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 2
		['WEAPON_BOTTLE_3'] = 'ปากฉลาม Tier 2 อัพเกรดขั้นที่ 3\n- Damage : 23\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_MACHETE_3'] = 'มาเชเต้ Tier 2 อัพเกรดขั้นที่ 3\n- Damage : 27\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 3
		['WEAPON_DAGGER_2'] = 'Dagger Tier 3 อัพเกรดขั้นที่ 2\n- Damage : 30\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNIFE_2'] = 'Knife Tier 3 อัพเกรดขั้นที่ 2\n- Damage : 30\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_POOLCUE_2'] = 'ไม้พูล Tier 3 อัพเกรดขั้นที่ 2\n- Damage : 21\n- ประเภท : อาวุธสองมือ\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_REVOLVER_MK2'] = 'Revolver Mk.2\n- Damage : 1\n- เอฟเฟค : ทำให้ผู้ถูกยิงติดสถานะสตั้นชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
	
		-- Legendary (4)
			-- tier 1
		['WEAPON_KNUCKLE_5'] = 'สนับมือ Tier 1 อัพเกรดขั้นที่ 5\n- Damage : 17\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
			-- tier 3
		['WEAPON_DAGGER_3'] = 'Dagger Tier 3 อัพเกรดขั้นที่ 3\n- Damage : 33\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_KNIFE_3'] = 'Knife Tier 3 อัพเกรดขั้นที่ 3\n- Damage : 33\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_POOLCUE_3'] = 'ไม้พูล Tier 3 อัพเกรดขั้นที่ 3\n- Damage : 23\n- ประเภท : อาวุธสองมือ\n- สามารถใช้ปล้นผู้เล่นอื่นได้\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
		['WEAPON_REVOLVER_MK3'] = 'Revolver Mk.3\n- Damage : 1\n- เอฟเฟค : ทำให้ผู้ถูกยิงติดสถานะสตั้นชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟอาวุธ',
	

		-- Special (5)
			-- agency
		['WEAPON_BOTTLE_SOS'] = 'ปากฉลาม เจ้าหน้าที่ใช้เพื่อสลายการรวมตัวของผู้ต้องหาและเพื่อต่อสู้กับผู้ต้องหาในระยะประชิด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['WEAPON_NIGHTSTICK'] = 'กระบอง เจ้าหน้าที่ใช้เพื่อสลายการรวมตัวของผู้ต้องหาและเพื่อต่อสู้กับผู้ต้องหาในระยะประชิด\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['WEAPON_PUMPSHOTGUN'] = 'ปืนลูกซองยาง เจ้าหน้าที่ใช้เพื่อสลายการรวมตัวของผู้ต้องหาและทำให้ผู้ต้องหาติดสถานะสตั้นชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['WEAPON_SNIPERRIFLE'] = 'ปืนสไนเปอร์ เจ้าหน้าที่ใช้เพื่อทำให้ผู้ต้องหาติดสถานะสตั้นชั่วคราวในระยะไกลเท่านั้น\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
		['WEAPON_STUNGUN'] = 'ปืนไฟฟ้า เจ้าหน้าที่ใช้เพื่อยิงทำลายยางยานพาหนะและทำให้ผู้ต้องหาติดสถานะสตั้นชั่วคราว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ร้านค้าหน่วยงาน',
			-- tournament
		['T1_WEAPON_BOTTLE'] = 'อาวุธสำหรับการแข่งขัน Tournament เท่านั้น',
		['T1_WEAPON_KNUCKLE'] = 'อาวุธสำหรับการแข่งขัน Tournament เท่านั้น',
		['T1_WEAPON_MACHETE'] = 'อาวุธสำหรับการแข่งขัน Tournament เท่านั้น',
		['T1_WEAPON_POOLCUE'] = 'อาวุธสำหรับการแข่งขัน Tournament เท่านั้น',
	},
	
	accessory = {
		['player_bags'] = '',
		['player_bracelet'] = '',
		['player_clothes'] = '',
		['player_ears'] = '',
		['player_glasses'] = '',
		['player_helmet'] = '',
		['player_mask'] = '',
		['player_pants'] = '',
		['player_shoes'] = '',
		['player_watch'] = '',
	},

	personal = {
		['id_card'] = 'ใช้งานเพื่อแสดงบัตรประชาชนให้กับผู้เล่นใกล้เคียง (ผู้เล่นอื่นจะเห็นชื่อและอาชีพของคุณ)',
	},
}