-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {}

Config.EquipmentRental = {
    Rental = {
        enable = true,      -- เปิดใช้งานร้านเช่าอุปกรณ์หรือไม่
        coords = vector3(4972.6060, -5598.6284, 23.7025),      -- พิกัดของร้านเช่าอุปกรณ์
        
        render_distance = 30.0,      -- ระยะการมองเห็น (ต้องมีจุดทศนิยม)
        action_distance = 1.5,       -- ระยะที่สามารถกดปุ่มได้ (ต้องมีจุดทศนิยม)

        marker = {  
            type = 29,      -- ประเภทของ Marker
            scale = {   
                x = 1.0,        -- ขนาดของ Marker แกน X (ต้องมีจุดทศนิยม)
                y = 1.0,        -- ขนาดของ Marker แกน Y (ต้องมีจุดทศนิยม)
                z = 1.0,        -- ขนาดของ Marker แกน Z (ต้องมีจุดทศนิยม)
            }, 
            color = {   
                r = 255,     -- สีของ Marker (Red)
                g = 204,        -- สีของ Marker (Green)    
                b = 0,        -- สีของ Marker (Blue)
                a = 100     -- ความโปร่งใส / ทึบของ Marker (Alpha)
            } 
        },

        blip = {
            enable = true,      -- เปิดใช้งานสัญลักษณ์บนแผนที่หรือไม่    
            sprite = 1,       -- เลขไอดีของสัญลักษณ์บนแผนที่
            size = 1.0,     -- ขนาดของสัญลักษณ์บนแผนที่ (ต้องมีจุดทศนิยม)
            color = 0,     -- สีของสัญลักษณ์บนแผนที่
            title = 'Gun Rental'      -- ชื่อของสัญลักษณ์บนแผนที่
        }
    },

    Shop = {
        [1] = {
            enable_if_weapon = true,        -- เปิดใช้งานหากของชิ้นนี้เป็นอาวุธ
            label = 'ปืนล่าสัตว์',      -- ชื่อทีจะแสดงบนเมนู
            name = 'WEAPON_MUSKET',      -- ชื่ออาวุธ / ไอเทม
            count = 100,      -- จำนวน
            price = 3000,        -- ราคา
        },
    },
}

Config.CarRental = {
    Rental = {
        enable = false,      -- เปิดใช้งานร้านเช่ารถหรือไม่
        coords = vector3(4914.52, -5230.92, 2.52),      -- พิกัดของร้านเช่ารถ
         
        render_distance = 30.0,     -- ระยะการมองเห็น (ต้องมีจุดทศนิยม)
        action_distance = 1.5,      -- ระยะที่สามารถกดปุ่มได้ (ต้องมีจุดทศนิยม)
         
        marker = {  
            type = 36,      -- ประเภทของ Marker
            scale = {   
                x = 1.0,        -- ขนาดของ Marker แกน X (ต้องมีจุดทศนิยม)
                y = 1.0,        -- ขนาดของ Marker แกน Y (ต้องมีจุดทศนิยม)
                z = 1.0,        -- ขนาดของ Marker แกน Z (ต้องมีจุดทศนิยม)
            }, 
            color = {   
                r = 95,     -- สีของ Marker (Red)
                g = 187,        -- สีของ Marker (Green)    
                b = 230,        -- สีของ Marker (Blue)
                a = 200     -- ความโปร่งใส / ทึบของ Marker (Alpha)
            } 
        },

        blip = {
            enable = false,      -- เปิดใช้งานสัญลักษณ์บนแผนที่หรือไม่
            sprite = 523,       -- เลขไอดีของสัญลักษณ์บนแผนที่
            size = 0.7,     -- ขนาดของสัญลักษณ์บนแผนที่ (ต้องมีจุดทศนิยม)
            color = 11,     -- สีของสัญลักษณ์บนแผนที่
            title = 'Car Rental'        -- ชื่อของสัญลักษณ์บนแผนที่
        }
    },

    Shop = {
        [1] = {
            label = 'BF 400',       -- ชื่อทีจะแสดงบนเมนู
            name = 'bf400',     -- ชื่อโมเดลรถ
            price = 50,     -- ราคา
            refund = 25,        -- คืนเงิน (จะได้รับเงินคืนเมื่อนำรถไปเก็บ แต่จะไม่ได้เงินคืนหากออกจากเกม)
        },
        [2] = {
            label = 'Blazer',       -- ชื่อทีจะแสดงบนเมนู
            name = 'blazer',        -- ชื่อโมเดลรถ
            price = 100,        -- ราคา
            refund = 50,        -- คืนเงิน (จะได้รับเงินคืนเมื่อนำรถไปเก็บ แต่จะไม่ได้เงินคืนหากออกจากเกม)
        },
    },

    Spawner = {
        coords = vector3(4912.44, -5226.71, 2.52),      -- พิกัดจุดที่จะเรียกรถออกมา
        heading = 34.73     -- ทิศทาง
    },

    Deleter = {
        coords = vector3(4885.47021484375, -5184.31005859375, -6.67999982833862),      -- พิกัดจุดที่จะเก็บรถ

        render_distance = 30.0,     -- ระยะการมองเห็น (ต้องมีจุดทศนิยม)
        action_distance = 5.0,      -- ระยะที่สามารถกดปุ่มได้ (ต้องมีจุดทศนิยม)

        marker = {  
            show_in_car = false,     -- แสดง Marker เฉพาะตอนอยู่บนรถหรือไม่
            type = 1,       -- ประเภทของ Marker
            scale = {   
                x = 5.0,        -- ขนาดของ Marker แกน X (ต้องมีจุดทศนิยม)
                y = 5.0,        -- ขนาดของ Marker แกน Y (ต้องมีจุดทศนิยม)
                z = 1.0,        -- ขนาดของ Marker แกน Z (ต้องมีจุดทศนิยม)
            }, 
            color = {   
                r = 255,        -- สีของ Marker (Red)
                g = 0,      -- สีของ Marker (Green)    
                b = 0,      -- สีของ Marker (Blue)
                a = 200     -- ความโปร่งใส / ทึบของ Marker (Alpha)
            } 
        },

        blip = {
            enable = false,      -- เปิดใช้งานสัญลักษณ์บนแผนที่หรือไม่
            sprite = 523,       -- เลขไอดีของสัญลักษณ์บนแผนที่
            size = 0.7,     -- ขนาดของสัญลักษณ์บนแผนที่ (ต้องมีจุดทศนิยม)
            color = 1,      -- สีของสัญลักษณ์บนแผนที่
            title = 'Car Return'        -- ชื่อของสัญลักษณ์บนแผนที่
        }
    }
}