Devil = {}
Devil['playerLoaded']		= 'esx:playerLoaded'   
Devil['BASE']				= 'esx:getSharedObject'   
Devil['command_delcar']		= 'delallcar'    						-- กด T แล้วพิมพ์ /delallcar และตามด้วยนาที เช่น /delallcar 30 (หรือ กด F8 แล้วพิมพ์ delallcar และตามด้วยนาที)
Devil['command_wartime']	= 'wartime'    							-- กด T แล้วพิมพ์ /wartime และตามด้วยนาที เช่น /wartime 30 (หรือ กด F8 แล้วพิมพ์ wartime และตามด้วยนาที)
Devil['SoundDelete']		= 'Delete.mp3'							-- ไฟล์ประกาศเสียงตอนขึ้นประกาศลบรถ (ใส่ชื่อให้ตรงไม่งั้นไม่มีเสียง)
Devil['announce']			= 'Car.mp3'								-- ไฟล์ประกาศเสียงหลังลบเสร็จแล้ว (ใส่ชื่อให้ตรงไม่งั้นไม่มีเสียง)
Devil['textdelcar']			= 'ระบบจะทำการลบรถ อีก %s นาที %s วินาที'	-- อักษรในการประกาศ เวลาลบรถ บรรทัด 1
Devil['textdelcar2']		= 'ระบบลบรถอัตโนมัติ'					   -- อักษรในการประกาศ เวลาลบรถ บรรทัด 2
Devil['textdelcar3']		= 'ขึ้นรถภายในเวลา มิเช่นนั้นรถคุณจะถูกลบ'		-- อักษรในการประกาศ เวลาลบรถ บรรทัด 3
Devil['textdelcarWar']		= 'ระบบจะทำการลบรถ อีก %s นาที %s วินาที'	-- อักษรในการประกาศ เวลาลบรถ ในช่วง War
Devil['textWar']			= 'ช่วงเวลา War Time'					  -- อักษรในการประกาศ เวลาWarบรรทัด 1
Devil['textWar2']			= 'กรุณาใส่เสื้อสีของท่านระหว่างเล่น'			-- อักษรในการประกาศ เวลาWarบรรทัด 2
Devil['EnableDebug']		= true									-- ใช้ไม่เป็น อย่า เปิด สำ หรับ ทีมงาน Devil_Hunter
Devil['Volume']				= 0.2									-- ระดับเสียง (โดยปกติแล้วเชิฟเวอร์ส่วนมากจะตั้งไว้ประมาณ 0.2)
Devil['deltime']			= 0.5              						-- ระดับเสียง (โดยปกติแล้วเชิฟเวอร์ส่วนมากจะตั้งไว้ประมาณ 0.2)
Devil['wartimetime']		= 30         							-- เวลาเริ่มต้นถ้าไม่ได้ตั้ง เวลาลบรถ (นาที)

--[[delallcar ลบรถ
		wartime เวลาWar
{เวลาในการประกาศ,ฟังชั่นที่จะใช้งาน,นับถอยหลังกี่นาที}, ]]

Devil['AutoTime'] = {
	{"01:46","delallcar",1},	-- เวลา ลบรถ
	{"10:00","delallcar",3},	-- เวลา ลบรถ
	{"10:30","delallcar",3},	-- เวลา ลบรถ
	{"11:00","delallcar",3},	-- เวลา ลบรถ
	{"11:30","delallcar",3},	-- เวลา ลบรถ
	{"17:00","delallcar",3},	-- เวลา ลบรถ
	{"17:30","delallcar",3},	-- เวลา ลบรถ
	{"02:00","delallcar",3},	-- เวลา ลบรถ
	{"02:30","delallcar",3},	-- เวลา ลบรถ
	{"03:00","delallcar",3},	-- เวลา ลบรถ
	{"03:30","delallcar",3},	-- เวลา ลบรถ
	{"04:00","delallcar",3},	-- เวลา ลบรถ
	{"04:30","delallcar",3},	-- เวลา ลบรถ
	{"05:00","delallcar",3},	-- เวลา ลบรถ
	{"05:30","delallcar",3},	-- เวลา ลบรถ
}
