-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

-- กุญแจยานพาหนะ
Config.VehicleKeyActions = {
	can_use = true,			-- สามารถใช้งานกุญแจยานพาหนะได้หรือไม่
	can_drop = true,		-- สามารถทิ้งกุญแจยานพาหนะได้หรือไม่
	can_give = true,		-- สามารถมอบกุญแจยานพาหนะให้ผู้อื่นได้หรือไม่
	can_shortcut = true		-- สามารถใช้งานกุญแจยานพาหนะใน Shortcuts ได้หรือไม่
}

-- ค่าความหายากของกุญแจยานพาหนะ
Config.VehicleKeyRarity = 5


-- ปิดกระเป๋าเมื่อใช้กุญแจยานพาหนะ
Config.CloseInventoryOnUseVehicleKey = true

-- ปิดกระเป๋าเมื่อทิ้งกุญแจยานพาหนะ
Config.CloseInventoryOnDropVehicleKey = true


-- กุญแจบ้าน
Config.HouseKeyActions = {
	can_use = true,			-- สามารถใช้งานกุญแจบ้านได้หรือไม่
	can_drop = true,		-- สามารถทิ้งกุญแจบ้านได้หรือไม่
	can_give = true,		-- สามารถมอบกุญแจบ้านให้ผู้อื่นได้หรือไม่
	can_shortcut = true		-- สามารถใช้งานกุญแจบ้านใน Shortcuts ได้หรือไม่
}

-- ค่าความหายากของกุญแจบ้าน
Config.HouseKeyRarity = 0

-- ปิดกระเป๋าเมื่อใช้กุญแจบ้าน
Config.CloseInventoryOnUseHouseKey = true

-- ปิดกระเป๋าเมื่อทิ้งกุญแจบ้าน
Config.CloseInventoryOnDropHouseKey = true