-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {}

Config.Primary = {
    ObjectName = "hei_prop_carrier_cargo_04a",      -- ชื่อ Object ของกล่องแอร์ดรอป
    AdministratorGroup = 'admin',        -- ชื่อยศของผู้ดูแลระบบ

    EnableAdministratorEnter = true,     -- เปิดให้ผู้ดูแลระบบสามารถเข้าไปในวงแอร์ดรอปได้หรือไม่
    EnableVehicleEnter = false,     -- เปิดให้ยานพาหนะสามารถเข้าไปในวงแอร์ดรอปได้หรือไม่
    EnableExactionZone = false,      -- เปิดใช้งานการบีบบังคับของวงแอร์ดรอปหรือไม่
    EnableDecreaseHealth = true,        -- เปิดให้เลือดผู้เล่นลดเมื่อออกจากวงแอร์ดรอปหรือไม่ (ถ้าปิดการใช้งานผู้เล่นที่ออกจากวงจะถูกตัดสิทธิ์ในการเล่นแอร์ดรอป และเด้งไปที่จุด EliminateCoords)
    EnableEndingRevive = true,     -- เปิดให้ชุบชีวิตผู้เล่นทั้งหมดหลังมีคนเก็บแอร์ดรอปหรือไม่
    EnableEndingHeal = true,       -- เปิดให้เพิ่มเลือดผู้เล่นทุกคนหลังมีคนเก็บแอร์ดรอปหรือไม่

    StartingRadius = 100.0,     -- ขนาดเริ่มต้นของวงแอร์ดรอป
    EndingRadius = 10.0,        -- ขนาดสุดท้ายของวงแอร์ดรอป
    MinusRadius = 0.5,      -- รัศมีในการการบีบบังคับของวงแอร์ดรอป / ExactionTime 1 ครั้ง
    ExactionTime = 2,        -- เวลาในการบีบบังคับของวงแอร์ดรอปเมื่อหมดเวลา UnlockTime (หน่วยเป็นวินาที)
 
    UnlockTime = 10.0,     -- เวลาที่กล่องแอร์ดรอปจะปลดล็อคให้สามารถเก็บได้หลังจากแอร์ดรอปตก (หน่วยเป็นนาที)
    RemoveTime = 30,        -- เวลาที่แอร์ดรอปจะลบออกเมื่อไม่มีคนเก็บ (หน่วยเป็นนาที) 
    OpenBoxDuration = 120,       -- ระยะเวลาในการเปิดกล่องแอร์ดรอป (หน่วยเป็นวินาที)
    InjuredHealth = 5,        -- จำนวนเลือดที่ลดเมื่อตัวละครอยู่นอกวงแอร์ดรอป
    EndingHealth = 200,     -- จำนวนเลือดที่จะเพิ่มเมื่อจบแอร์ดรอป (ถ้าเปิดใช้งาน EnableEndingHeal)

    Key = {
        action = 38,        -- ปุ่มที่ใช้สำหรับเปิดกล่องแอร์ดรอป
        cancel = 73,        -- ปุ่มที่ใช้สำหรับยกเลิกการเปิดกล่องแอร์ดรอป
    },

    Command = {
        drop_all = 'airdrops',      -- คำสั่งที่ใช้สำหรับเรียกแอร์ดรอป (ทุกลูก) ตัวอย่างคำสั่ง /airdrops (เฉพาะผู้ดูแลระบบเท่านั้นที่จะสามารถใช้คำสั่งนี้ได้)
        drop_split = 'airdrop'      -- คำสั่งที่ใช้สำหรับเรียกแอร์ดรอป (ลูกเดียว) ตัวอย่างคำสั่ง /airdrop เลขแอร์ดรอป (เฉพาะผู้ดูแลระบบเท่านั้นที่จะสามารถใช้คำสั่งนี้ได้)      
    },
    
    Sound = {
        enable = true,      -- เปิดใช้งานเสียงแอร์ดรอปหรือไม่
        file = "airdropsound",     -- ชื่อไฟล์เสียงแอร์ดรอป (ไฟล์จะต้องเป็นนามสกุล .ogg เท่านั้นและขนาดไฟล์ไม่ควรเกิน 150KB)
        volume = 0.2,       -- ความดังของเสียงแอร์ดรอป (ปรับได้ตั้งแต่ 0.1 - 1.0)
    },

    Animation = {
        anim_dict = "anim@amb@clubhouse@tutorial@bkr_tut_ig3@",      -- ชื่ออนิเมชั่นตอนเก็บแอร์ดรอป (ดูรายชื่อ Animation ต่างๆได้ที่เว็บ https://alexguirre.github.io/animations-list/)
        anim = "machinic_loop_mechandplayer",        -- ชื่ออนิเมชั่นตอนเก็บแอร์ดรอป (ดูรายชื่อ Animation ต่างๆได้ที่เว็บ https://alexguirre.github.io/animations-list/)
    },

    EliminateCoords = {
        x = 233.17,     -- พิกัด X ของจุดที่ผู้เล่นถูกตัดสิทธิ์
        y = -881.23,        -- พิกัด Y ของจุดที่ผู้เล่นถูกตัดสิทธิ์
        z = 30.49,      -- พิกัด Z ของจุดที่ผู้เล่นถูกตัดสิทธิ์
        heading = 334.76        -- ทิศทางของจุดที่ผู้เล่นถูกตัดสิทธิ์        
    }
}

Config.AutomaticTime = {
    All = {
        enable = true,      -- เปิดใช้งานแอร์ดรอปตก (ทุกลูก) เป็นช่วงเวลาหรือไม่ 
        time = {"10:00", "19:00"}       -- ช่วงเวลาที่แอร์ดรอปจะตก
    },

    Split = {
        enable = false,      -- เปิดใช้งานแอร์ดรอปตก (ลูกเดียว) เป็นช่วงเวลาหรือไม่
        boxes = {
            [4] = {     -- เลขแอร์ดรอป (เลขต้องตรงกับ Config.Boxes)
                time = {"21:00"}       -- ช่วงเวลาที่แอร์ดรอปจะตก (เวลาของแต่ละลูกห้ามตรงกันและต้องห่างกันอย่างน้อย 30 นาที)
            },
        }
    }
}

Config.Boxes = {
    [1] = {     -- เลขแอร์ดรอป
        BoxName = "แอร์ดรอปประชาชน",     -- ชื่อกล่องแอร์ดรอป (ห้ามซ้ำกัน)
        ImageLink = "https://img5.pic.in.th/file/secure-sv1/tg_airdrop.citizen.png",     -- ลิงก์ที่อยู่ของรูปภาพแอร์ดรอป

        Coords = {
            vector3(-1286.06, -2977.99, 13.48),     -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
            vector3(933.96, -3169.59, 5.4),     -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
            vector3(1151.79, 122.99, 81.59),        -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
        },

        BlacklistJobs = {
            'police',       -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
            'ambulance'        -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
        }, 

        Blips = {
            enable_circle_radius = true,     -- เปิดใช้งานวงรัศมีแอร์ดรอปบนแผนที่หรือไม่
            radius_color = 1,        -- สีของวงรัศมีแอร์ดรอป
            radius_opacity = 70,      -- ความทึบแสงของวงรัศมีแอร์ดรอป
            
            sprite = 94,       -- รูปสัญลักษณ์ของ Blips 
            scale = 1.0,        -- สีของ Blips 
            color = 5,      -- ขนาดของ Blips 
            title = 'Citizen Airdrop'       -- ข้อความของ Blips 
        },

        MarkerColor = { 
            red = 255,      -- สีของวงแอร์ดรอป      
            green = 204,        -- สีของวงแอร์ดรอป      
            blue = 0,       -- สีของวงแอร์ดรอป     
            alpha = 75      -- ความทึบแสงของสีวงแอร์ดรอป      
        },

        Reward = {
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "weapon_box",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "exp",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "vest",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "box_ad_citizen",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                count = 1,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
        }
    },
    [2] = {     -- เลขแอร์ดรอป
        BoxName = "แอร์ดรอปหน่วยงาน",     -- ชื่อกล่องแอร์ดรอป (ห้ามซ้ำกัน)
        ImageLink = "https://img5.pic.in.th/file/secure-sv1/tg_airdrop.agency.png",     -- ลิงก์ที่อยู่ของรูปภาพแอร์ดรอป

        Coords = {
            vector3(2727.08, 1362.17, 24.02),       -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
            vector3(1376.24, -740.25, 66.73),       -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
        },

        BlacklistJobs = {
            'unemployed'       -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
        },

        Blips = {
            enable_circle_radius = true,     -- เปิดใช้งานวงรัศมีแอร์ดรอปบนแผนที่หรือไม่
            radius_color = 1,        -- สีของวงรัศมีแอร์ดรอป
            radius_opacity = 100,      -- ความทึบแสงของวงรัศมีแอร์ดรอป

            sprite = 94,       -- รูปสัญลักษณ์ของ Blips
            scale = 1.0,        -- สีของ Blips
            color = 3,      -- ขนาดของ Blips
            title = 'Agency Airdrop'       -- ข้อความของ Blips
        },

        MarkerColor = {
            red = 0,      -- สีของวงแอร์ดรอป
            green = 259,        -- สีของวงแอร์ดรอป
            blue = 255,       -- สีของวงแอร์ดรอป
            alpha = 75      -- ความทึบแสงของสีวงแอร์ดรอป
        },

        Reward = {
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "weapon_box",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "exp",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "cron",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 1,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
        }
    },
    [3] = {     -- เลขแอร์ดรอป
        BoxName = "แอร์ดรอปแก๊ง",     -- ชื่อกล่องแอร์ดรอป (ห้ามซ้ำกัน)
        ImageLink = "https://img2.pic.in.th/pic/tg_airdrop.gang.png",     -- ลิงก์ที่อยู่ของรูปภาพแอร์ดรอป

        Coords = {
            vector3(-2165.8400, -401.8200, 13.3900),      -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)           
            vector3(627.5, 625.3, 128.41),      -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
            vector3(-801.01, -1301.9, 4.5),     -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
        },

        BlacklistJobs = {
            'police',       -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
            'ambulance'        -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
        }, 

        Blips = {
            enable_circle_radius = true,     -- เปิดใช้งานวงรัศมีแอร์ดรอปบนแผนที่หรือไม่
            radius_color = 1,        -- สีของวงรัศมีแอร์ดรอป
            radius_opacity = 100,      -- ความทึบแสงของวงรัศมีแอร์ดรอป

            sprite = 94,       -- รูปสัญลักษณ์ของ Blips 
            scale = 1.0,        -- สีของ Blips 
            color = 1,      -- ขนาดของ Blips 
            title = 'Gang Airdrop'       -- ข้อความของ Blips 
        },

        MarkerColor = { 
            red = 255,      -- สีของวงแอร์ดรอป      
            green = 0,        -- สีของวงแอร์ดรอป      
            blue = 0,       -- สีของวงแอร์ดรอป     
            alpha = 75      -- ความทึบแสงของสีวงแอร์ดรอป      
        },

        Reward = {
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "weapon_box",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "exp",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 5,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "vest",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 5,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "box_ad_gang",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                count = 1,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
        }
    },
    [4] = {     -- เลขแอร์ดรอป
    BoxName = "แอร์ดรอปครอบครัว",     -- ชื่อกล่องแอร์ดรอป (ห้ามซ้ำกัน)
    ImageLink = "https://img5.pic.in.th/file/secure-sv1/tg_airdrop.family.png",     -- ลิงก์ที่อยู่ของรูปภาพแอร์ดรอป

    Coords = {
        vector3(-218.2899, -2412.9199, 6.0),      -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)           
        vector3(2546.8494, -384.1803, 92.9928),      -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
        vector3(1924.6573, -1012.0095, 80.1764),     -- พิกัดจุดตกของกล่องแอร์ดรอป (สุ่ม)
    },

    BlacklistJobs = {
        'police',       -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
        'ambulance'        -- อาชีพที่ไม่อนุญาติให้เก็บแอร์ดรอป
    }, 

    Blips = {
        enable_circle_radius = true,     -- เปิดใช้งานวงรัศมีแอร์ดรอปบนแผนที่หรือไม่
        radius_color = 1,        -- สีของวงรัศมีแอร์ดรอป
        radius_opacity = 100,      -- ความทึบแสงของวงรัศมีแอร์ดรอป

        sprite = 94,       -- รูปสัญลักษณ์ของ Blips 
        scale = 1.0,        -- สีของ Blips 
        color = 27,      -- ขนาดของ Blips 
        title = 'Family Airdrop'       -- ข้อความของ Blips 
    },

    MarkerColor = { 
        red = 155,      -- สีของวงแอร์ดรอป      
        green = 0,        -- สีของวงแอร์ดรอป      
        blue = 255,       -- สีของวงแอร์ดรอป     
        alpha = 75      -- ความทึบแสงของสีวงแอร์ดรอป      
    },

        Reward = {
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "weapon_box",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 3,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "exp",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 5,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "item",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                item_name = "vest",     -- ชื่อไอเทมที่จะได้รับ
                item_count = 5,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
            {
                type = "box_ad_family",      -- ประเภทของรางวัล (item = ไอเทม / money = เงินสด / blackmoney = เงินแดง)
                count = 1,      -- จำนวนไอเทมที่จะได้รับ
                percent = 100       -- โอกาสที่จะได้รับ (ตั้งแต่ 0 - 100 เท่านั้น)
            },
        }
    },
}