-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {} 

Config.EnableCayoPerico = true      -- เปิดใช้งานเกาะ Cayo Perico หรือไม่ (หากในเซิร์ฟเวอร์มีเกาะ Cayo Perico อยู่แล้วก่อนลงสคริปต์นี้ให้ปิดส่วนนี้ไป เพราะถ้าเปิดจะกิน Resmon ฝั่ง Client จะมากขึ้น)
Config.CayoPerico = vector3(4840.571, -5174.425, 2.0)       -- พิกัดของเกาะ (ไม่แนะนำให้ปรับเปลี่ยน หรือหากต้องการปรับเปลี่ยนโปรดติดต่อ TG Developer)

Config.EnableMinimap = false     -- เปิดให้โชว์มินิแมพเมื่อเข้าไปในโซนล่าสัตว์หรือไม่
Config.EnablePVP = false        -- เปิดให้ผู้เล่นสามารถฆ่ากันเองบนเกาะได้หรือไม่
Config.EnableDeleteEntityEntireWorld = true       -- เปิดให้ลบ Entity ทั้งโลกเมื่อรีสคริปต์หรือไม่ (หากปิดจะลบ Entity แค่ในโซนล่าสัตว์และอาจมีโอกาสที่จะลบ Entity ไม่หมด)
Config.EnableRemoveWeaponWhenLeavingIsland = true     -- เปิดให้ลบอาวุธเมื่อออกจากเกาะหรือไม่ (ใส่ชื่ออาวุธใน Config.RemoveWeapon)            

Config.MenuDefault = {
    Align = 'center',       -- ตำแหน่งของเมนู
    FontColor = 'lightblue'     -- สีของฟอนต์ราคา
}

Config.Working = {
    Duration = 3,        -- ระยะเวลาในการทำงาน (หน่วยเป็นวินาที)
    Label = 'กำลังเก็บสัตว์',        -- ข้อความที่จะแสดงบนหลอดโหลด

    Animation = {
        anim_dict = "anim@amb@clubhouse@tutorial@bkr_tut_ig3@",     -- ชื่ออนิเมชั่นตอนเก็บของ (ดูรายชื่อ Animation ต่างๆได้ที่เว็บ https://alexguirre.github.io/animations-list/)
        anim = "machinic_loop_mechandplayer",       -- ชื่ออนิเมชั่นตอนเก็บของ (ดูรายชื่อ Animation ต่างๆได้ที่เว็บ https://alexguirre.github.io/animations-list/)
    }
}

Config.UsableWeapon = {     
    'WEAPON_MUSKET',        -- ชื่ออาวุธที่สามารถใช้ในการฆ่าสัตว์ได้ (หากฆ่าสัตว์ด้วยอาวุธที่นอกเหนือจากนี้จะไม่ได้รับไอเทม)               
}

Config.RemoveWeapon = {         
    'WEAPON_MUSKET',        -- ชื่ออาวุธที่ต้องการให้ลบเมื่อออกจากเกาะ      
}

Config.Zone = {
    CarEnter = {
        enable = false,      -- เปิดใช้งานห้ามรถเข้าไปในโซนล่าสัตว์หรือไม่
        radius = 10.0,       -- ระยะที่จะบังคับลงจากรถเมื่อเข้าไปถึงโซนล่าสัตว์ (ต้องมีจุดทศนิยม)
    },

    Marker = {
        enable = false,      -- เปิดใช้งานวง Marker ของโซนล่าสัตว์หรือไม่ (หากเปิด Resmon ฝั่ง Client จะมากขึ้น)
        type = 1,       -- ประเภทของ Marker
        render_distance = 100.0,        -- ระยะการมองเห็น (ต้องมีจุดทศนิยม)
        height = 100.0,     -- ความสูงของ Marker (ต้องมีจุดทศนิยม)
    
        color = {
            r = 255,     -- สีของ Marker (Red)
            g = 204,        -- สีของ Marker (Green)      
            b = 0,         -- สีของ Marker (Blue)
            a = 100     -- ความโปร่งใส / ทึบของ Marker (Alpha)
        }
    },

    Blip = {
        enable = true,      -- เปิดใช้งาน Blip ของโซนล่าสัตว์หรือไม่ 
        color = 5,      -- สีของ Blip
        alpha = 100     -- ความโปร่งใส / ทึบของ Blip
    }
}

Config.Animal = {
    EnableWaterCheck = true,        -- เปิดเช็คหากสิ่งมีชีวิตลงน้ำจะทำการลบอัตโนมัติหรือไม่
    EnableActionKey = true,     -- เปิดให้กดปุ่มเพื่อเก็บของจากสัตว์หรือไม่ (หากปิดการใช้งานจะเป็นแบบเดินชนไม่ต้องกดปุ่ม)
    EnableBonusWhenHeadShot = false,        -- เปิดให้ได้รับไอเทมโบนัสเมื่อยิงโดนหัวเท่านั้นหรือไม่

    Action = {
        enable_take_action = false,      -- เปิดให้สัตว์วิ่งหนีเมื่อเข้าใกล้หรือไม่
        enable_combat = true,       -- เปิดให้สัตว์โจมตีเมื่อเข้าใกล้หรือไม่ หากเปิดใช้งานจะต้องเปิด enable_take_action ด้วย (เฉพาะสัตว์ที่สามารถโจมตีได้ เช่น เสือ แต่ถ้าหากเป็นสัตว์ที่ไม่สามารถโจมตีได้จะวิ่งหนีแทน)
        render_distance = 40.0      -- ระยะการมองเห็นของสัตว์
    },

    Coords = { -- พิกัดจุดเกิดของสัตว์
        vector3(4794.6802, -5730.5342, 24.9497)
    },

    Count = 17,      -- จำนวนการเกิดของสัตว์
    Radius = 175.0,       -- ระยะการเกิดของสัตว์ (ต้องมีจุดทศนิยม)
    RemoveTime = 30,     -- ระยะเวลาที่จะลบสัตว์เมื่อสัตว์ตายและไม่มีคนเก็บ (หน่วยเป็นวินาที)
    ActionRadius = 3.0,     -- ระยะในการเก็บของจากสัตว์ที่ตายแล้ว

    Model = {
        [1] = {
            name = 'a_c_boar',     -- ชื่อโมเดลสัตว์ที่จะเกิด
            health = 200
        },
        [2] = {
            name = 'a_c_deer',     -- ชื่อโมเดลสัตว์ที่จะเกิด
            health = 200
        },
        [3] = {
            name = 'a_c_mtlion',     -- ชื่อโมเดลสัตว์ที่จะเกิด
            health = 200
        },
    },
    
    Blip = {                   
        enable = true,      -- เปิดใช้งานสัญลักษณ์บนแผนที่หรือไม่
        sprite = 463,       -- เลขไอดีของสัญลักษณ์บนแผนที่
        size = 0.5,     -- ขนาดของสัญลักษณ์บนแผนที่
        color = 1,      -- สีของสัญลักษณ์บนแผนที่
        title = 'Animal'        -- ชื่อของสัญลักษณ์บนแผนที่
    },
}

Config.Reward = {
    [1] = {
        Model = 'a_c_boar',         -- ชื่อโมเดลที่จะได้รับ
        ItemName = "hunt_1",        -- ชื่อไอเทมที่จะได้รับ
        ItemCount = {1,2},      -- จำนวนไอเทมที่จะได้รับแบบสุ่ม จากตัวอย่าง ItemCount = {1,1} คือจะได้รับไอเทม 1 ชิ้น

        ItemBonus = {
            {
                item_name = "amp_g",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 10          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "exp",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 5          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "bonus_eco ",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 1          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
        },
    },
    [2] = {
        Model = 'a_c_deer',       -- ชื่อโมเดลที่จะได้รับ
        ItemName = "hunt_2",      -- ชื่อไอเทมที่จะได้รับ
        ItemCount = {1,2},      -- จำนวนไอเทมที่จะได้รับแบบสุ่ม จากตัวอย่าง ItemCount = {1,2} คือจะสุ่มว่าจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น

        ItemBonus = {
            {
                item_name = "amp_g",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 10          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "exp",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 5          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "bonus_eco ",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 1          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
        },
    },
    [3] = {
        Model = 'a_c_mtlion',       -- ชื่อโมเดลที่จะได้รับ
        ItemName = "hunt_3",      -- ชื่อไอเทมที่จะได้รับ
        ItemCount = {1,2},      -- จำนวนไอเทมที่จะได้รับแบบสุ่ม จากตัวอย่าง ItemCount = {1,3} คือจะสุ่มว่าจะได้รับไอเทม 1 ชิ้น หรือ 3 ชิ้น

        ItemBonus = {
            {
                item_name = "amp_g",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 10          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "exp",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 5          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
            {
                item_name = "bonus_eco ",      -- ชื่อไอเทมโบนัสที่จะได้รับ
                item_count = {1,1},     -- จำนวนไอเทมโบนัสที่จะได้รับแบบสุ่ม จากตัวอย่าง item_count = {1,2} คือจะได้รับไอเทม 1 ชิ้น หรือ 2 ชิ้น
                percent = 1          -- โอกาสที่จะได้รับไอเทมโบนัส จากตัวอย่าง 100 คือ 100%
            },
        },
    },
}