-- This resource was scripted by TG DEVELOPER
-- Discord : https://discord.gg/yT9ySxbM9Y

Config = Config or {}

Config.Locale = {
    Notification = {
        equipment_rental = 'Press ~INPUT_CONTEXT~ to rent equipment',       -- ข้อความแจ้งเตือนเมื่อเข้าใกล้จุดเช่าอุปกรณ์ 
        car_rental = 'Press ~INPUT_CONTEXT~ to rent car',       -- ข้อความแจ้งเตือนเมื่อเข้าใกล้จุดเช่ารถ
        car_delete = 'Press ~INPUT_CONTEXT~ to delete car',     -- ข้อความแจ้งเตือนเมื่อเข้าใกล้จุดเก็บรถ
        pick_up = 'pickup_animal',       -- ข้อความแจ้งเตือนเมื่อเข้าใกล้สัตว์ที่ตายแล้ว
        
        item_full = 'ไอเทมในตัวของคุณเต็ม',        -- ข้อความแจ้งเตือนเมื่อไอเทมในตัวของคุณเต็ม
        item_bonus_full = 'ไอเทมโบนัสในตัวของคุณเต็ม',      -- ข้อความแจ้งเตือนเมื่อไอเทมโบนัสในตัวของคุณเต็ม
        no_money = 'คุณไม่มีเงินเพียงพอ',        -- ข้อความแจ้งเตือนเมื่อไม่มีเงินเพียงพอ
        not_rental_car = 'ไม่สามารถเก็บรถคันนี้ได้เนื่องจากไม่ใช่รถเช่า',      -- ข้อความแจ้งเตือนเมื่อไม่สามารถเก็บรถได้
        you_rented = 'คุณเช่ารถไปแล้วกรุณานำรถไปคืนก่อน',      -- ข้อความแจ้งเตือนเมื่อเช่ารถไปแล้ว
        you_not_killed = 'คุณไม่ได้เป็นคนฆ่าสัตว์',         -- ข้อความแจ้งเตือนเมื่อไม่ได้เป็นคนฆ่าสัตว์
        invalid_weapon = 'คุณใช้อาวุธในการฆ่าสัตว์ไม่ถูกต้อง',       -- ข้อความแจ้งเตือนเมื่อใช้อาวุธในการฆ่าสัตว์ไม่ถูกต้อง
        check_expoliter = 'พบความผิดปกติของ Event คุณถูกเตะออกจากเซิร์ฟเวอร์',     -- ข้อความแจ้งเตือนเมื่อพบความผิดปกติของ Event
    },

    Menu = {
        title_equipment_rental = 'ร้านเช่าอุปกรณ์',     -- ข้อความ Menu Default ของร้านเช่าอุปกรณ์
        title_car_rental = 'ร้านเช่ารถ',      -- ข้อความ Menu Default ของร้านเช่ารถ  
        confirm = 'ใช่',     -- ข้อความ Menu Default ของปุ่มยืนยันการซื้อ 
        deny = 'ไม่ใช่',      -- ข้อความ Menu Default ของปุ่มยกเลิกการซื้อ
    }
}