-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

-- เปิดใช้งาน NC Extensions ต่างๆ
Config.Extensions = {
	nc_notify = {						-- ใช้งาน Extension NC Notify
		enable = true,
		options = {
			locked = {
				enable = true,
				title = 'ล็อคยานพาหนะสำเร็จ',
				description = 'ยานพาหนะทะเบียน %s',
				color = '#db3f59',
				icon = 'lock',
				duration = 3000
			},
			unlocked = {
				enable = true,
				title = 'ปลดล็อคยานพาหนะสำเร็จ',
				description = 'ยานพาหนะทะเบียน %s',
				color = '#FFED3D',
				icon = 'unlock',
				duration = 3000
			},
			error = {
				enable = false,
				title = {
					general = 'ไม่สามารถล็อคหรือปลดล็อคยานพาหนะได้'
				},
				description = {
					no_vehicle_nearby = {
						error	= 'ไม่พบยานพาหนะของคุณในบริเวณใกล้เคียง'
					},
					not_owner = {
						error	= 'เนื่องจากยานพาหนะนี้ไม่ใช่ยานพาหนะของคุณ'
					}
				},
				icon = 'no_vehicle',
				color = '#dab028',
				duration = 4000
			}
		}
	}
}