Config = {
    ['Mode_bike'] = {
        -- ค่าลงทะเบียน
        StartPoint = vector3(1094.15, 2108.78, 55.39), -- จุดดึงผูิ้เล่น 
        CountDown = 50, -- เวลาในการลงทะเบียนก่อนที่จะเริ่ม  เเนะนำให้ตั้งตามนาทีเพลง
        FlyMode = false,
        Boost = true,
        MarkerDist = 7.0,
        SpawnVeh = {

            {
                Point = 1, -- จุดเช็คพ้อยที่จะได้รถ
                VehicleName = 'bf400', -- ชื่อรถ
                DeletePoint = 20 -- จุดเช็คพ้อยที่จะลบรถ
            }

        },

        AddWeapon = {

            -- {
            --     Point = 1, -- จุดเช็คพ้อยที่จะได้รับอาวุธ
            --     WeaponName = 'WEAPON_BAT', -- ชื่ออาวุธ
            --     DeletePoint = 2, -- จุดลบอาวุธ
            --     Active = false -- สถาณะว่าใช้งานจุดนี้หรือยัง
            -- }

        },

        CheckPoint = { -- จุดเช็คพ้อยแต่ละจุด

            ['CheckPoint_1'] = vector3(1108.8775634766, 2130.8369140625,53.299365997314),
            ['CheckPoint_2'] = vector3(1165.8819580078,2161.2277832031,53.764190673828),
            ['CheckPoint_3'] = vector3(1134.3604736328,2219.6477050781,48.37784576416),
            ['CheckPoint_4'] = vector3(1109.0310058594,2254.0463867188,48.623916625977),
            ['CheckPoint_5'] = vector3(1043.4138183594,2260.822265625,43.317012786865),
            ['CheckPoint_6'] = vector3(941.58575439453,2286.2258300781,44.88988494873),
            ['CheckPoint_7'] = vector3(980.49688720703,2324.40234375,48.112850189209),
            ['CheckPoint_8'] = vector3(940.85589599609,2358.9516601563,47.085948944092),
            ['CheckPoint_9'] = vector3(971.09289550781,2391.4133300781,50.964691162109),
            ['CheckPoint_10'] = vector3(1060.2268066406,2411.2702636719,49.526168823242),
            ['CheckPoint_11'] = vector3(1140.8216552734,2349.6899414063,53.899314880371),
            ['CheckPoint_12'] = vector3(1164.98046875,2266.5847167969,49.577503204346),
            ['CheckPoint_13'] = vector3(1164.4602050781,2444.2631835938,54.837894439697),
            ['CheckPoint_14'] = vector3(1027.9914550781,2437.8967285156,44.60436630249),
            ['CheckPoint_15'] = vector3(934.56872558594,2481.9169921875,49.364490509033),
            ['CheckPoint_16'] = vector3(894.86376953125,2384.3686523438,50.087646484375),
            ['CheckPoint_17'] = vector3(907.77209472656,2271.1040039063,45.100917816162),
            ['CheckPoint_18'] = vector3(980.71612548828,2229.8972167969,47.488445281982),
            ['CheckPoint_19'] = vector3(1052.8649902344,2174.1813964844,46.999412536621),
            ['CheckPoint_20'] = vector3(1105.4490966797,2133.2348632813,52.726314544678)

        },

        SprintPoint = { -- จุดเช็คพ้อยแต่ละจุด

            ['SprintPoint_5'] = vector3(1064.9515380859,2259.0146484375,44.593128204346),
            ['SprintPoint_10'] = vector3(1020.2388916016,2412.1323242188,53.219459533691),
            ['SprintPoint_13'] = vector3(1168.5899658203,2321.3649902344,56.614532470703),
            ['SprintPoint_16'] = vector3(889.16271972656,2445.259765625,49.701366424561),



        },

        EndPoint = 20, -- จุดเส้นชัย โดยปกติแล้วจะตั้งเป็นจุดเช็คพ้อยสุดท้าย

        RewardWinner = { -- ตั้งค่าของรางวัล

            Winner1 = {ITEM = 'test1', Amount = 1},

            Winner2 = {ITEM = 'test2', Amount = 1},

            Winner3 = {ITEM = 'test3', Amount = 15},

            Winner4 = {ITEM = 'test4', Amount = 15},

            Winner5 = {ITEM = 'test5', Amount = 15}

        }

    },


    ['Mode_jetski'] = {
        -- ค่าลงทะเบียน
        StartPoint = vector3(-2095.3271484375,4567.2661132813,2.6365990638733), -- จุดดึงผูิ้เล่น 
        CountDown = 50, -- เวลาในการลงทะเบียนก่อนที่จะเริ่ม  เเนะนำให้ตั้งตามนาทีเพลง
        FlyMode = false,
        Boost = true,
        MarkerDist = 10.0,
        SpawnVeh = {

            {
                Point = 1, -- จุดเช็คพ้อยที่จะได้รถ
                VehicleName = 'seashark3', -- ชื่อรถ
                DeletePoint = 28 -- จุดเช็คพ้อยที่จะลบรถ
            }

        },

        AddWeapon = {

             {
                 Point = 1, -- จุดเช็คพ้อยที่จะได้รับอาวุธ
                 WeaponName = 'WEAPON_BAT', -- ชื่ออาวุธ
                 DeletePoint = 2, -- จุดลบอาวุธ
                 Active = false -- สถาณะว่าใช้งานจุดนี้หรือยัง
             }

        },


        CheckPoint = {

            ['CheckPoint_1'] = vector3(-2054.1154785156,4602.1967773438,0.4717116355896),
            ['CheckPoint_2'] = vector3(-1899.1915283203,4649.8759765625,0.0013798996806145),
            ['CheckPoint_3'] = vector3(-1661.2039794922,4470.6088867188,0.13066355884075),
            ['CheckPoint_4'] = vector3(-1661.2039794922,4470.6088867188,0.13066355884075),
            ['CheckPoint_5'] = vector3(-1286.4888916016,4365.0463867188,4.7719082832336),
            ['CheckPoint_6'] = vector3(-1131.3618164063,4398.5439453125,9.1575736999512),
            ['CheckPoint_7'] = vector3(-931.7470703125,4384.9721679688,9.7939586639404),
            ['CheckPoint_8'] = vector3(-736.87286376953,4444.9399414063,14.827178001404),
            ['CheckPoint_9'] = vector3(-544.53625488281,4455.2568359375,21.211889266968),
            ['CheckPoint_10'] = vector3(-375.61715698242,4432.2290039063,30.486820220947),
            ['CheckPoint_11'] = vector3(-187.97091674805,4250.3256835938,33.448066711426),
            ['CheckPoint_12'] = vector3(207.25883483887,3689.1904296875,29.912153244019),
            ['CheckPoint_13'] = vector3(207.16024780273,3671.005859375,43.425540924072),
            ['CheckPoint_14'] = vector3(142.67727661133,3428.564453125,31.200492858887),
            ['CheckPoint_15'] = vector3(78.265274047852,3224.5627441406,31.154481887817),
            ['CheckPoint_16'] = vector3(-52.525230407715,3112.5275878906,29.143255233765),
            ['CheckPoint_17'] = vector3(-203.14454650879,3028.3928222656,21.614042282104),
            ['CheckPoint_18'] = vector3(-422.85543823242,2949.2683105469,14.084962844849),
            ['CheckPoint_19'] = vector3(-699.10699462891,2898.3813476563,17.066146850586),
            ['CheckPoint_20'] = vector3(-948.21484375,2819.5173339844,10.453561782837),
            ['CheckPoint_21'] = vector3(-1190.4202880859,2733.0324707031,5.4103779792786),
            ['CheckPoint_22'] = vector3(-1508.4307861328,2640.123046875,3.3920483589172),
            ['CheckPoint_23'] = vector3(-1693.9970703125,2601.7875976563,3.3765027523041),
            ['CheckPoint_24'] = vector3(-1946.3234863281,2564.8386230469,3.3742876052856),
            ['CheckPoint_25'] = vector3(-2114.4057617188,2591.8015136719,2.3601908683777),
            ['CheckPoint_26'] = vector3(-2319.6398925781,2599.4990234375,2.3575658798218),
            ['CheckPoint_27'] = vector3(-2319.6398925781,2599.4990234375,2.3575658798218),
            ['CheckPoint_28'] = vector3(-2677.513671875,2597.1630859375,2.3575658798218),
           

        },

        SprintPoint = { -- จุดเช็คพ้อยแต่ละจุด

            ['SprintPoint_3'] = vector3(-1784.0338134766,4551.0185546875,0.0027928650379181),
            ['SprintPoint_5'] = vector3(-1613.1567382813,4415.2192382813,0.07127819955349),
            ['SprintPoint_7'] = vector3(-1113.1389160156,4401.044921875,9.6241254806519),
            ['SprintPoint_8'] = vector3(-803.27862548828,4437.138671875,14.813318252563),
            ['SprintPoint_9'] = vector3(-588.38000488281,4444.8408203125,14.791829109192),
            ['SprintPoint_11'] = vector3(-288.74871826172,4355.78125,30.12575340271),
            ['SprintPoint_12'] = vector3(-111.7001953125,4182.375,30.008712768555),



        },

        EndPoint = 28, -- จุดเส้นชัย โดยปกติแล้วจะตั้งเป็นจุดเช็คพ้อยสุดท้าย

        RewardWinner = { -- ตั้งค่าของรางวัล

            Winner1 = {ITEM = 'test1', Amount = 1},

            Winner2 = {ITEM = 'test1', Amount = 1},

            Winner3 = {ITEM = 'test1', Amount = 15},

            Winner4 = {ITEM = 'test1', Amount = 15},

            Winner5 = {ITEM = 'test1', Amount = 15}

        }

    },


    ['Mode_car'] = {
        -- ค่าลงทะเบียน
        StartPoint = vector3(594.11682128906,6544.9404296875,28.10294342041), -- จุดดึงผูิ้เล่น 
        CountDown = 50, -- เวลาในการลงทะเบียนก่อนที่จะเริ่ม  เเนะนำให้ตั้งตามนาทีเพลง
        FlyMode = false,
        Boost = true,
        MarkerDist = 10.0,
        SpawnVeh = {

            {
                Point = 1, -- จุดเช็คพ้อยที่จะได้รถ
                VehicleName = 'corsita', -- ชื่อรถ
                DeletePoint = 27 -- จุดเช็คพ้อยที่จะลบรถ
            }

        },

        CheckPoint = {

            ['CheckPoint_1'] = vector3(554.67468261719,6551.4833984375,27.105602264404),
            ['CheckPoint_2'] = vector3(-491.61282348633,5854.4990234375,33.145084381104),
            ['CheckPoint_3'] = vector3(-860.94879150391,5443.6938476563,33.899272918701),
            ['CheckPoint_4'] = vector3(-1562.6408691406,4933.984375,60.896900177002),
            ['CheckPoint_5'] = vector3(-2058.9799804688,4471.2749023438,57.065296173096),
            ['CheckPoint_6'] = vector3(-2508.7478027344,3559.1125488281,14.149589538574),
            ['CheckPoint_7'] = vector3(-2986.8000488281,2037.4036865234,36.015396118164),
            ['CheckPoint_8'] = vector3(-3057.5366210938,1193.9372558594,21.820348739624),
            ['CheckPoint_9'] = vector3(-2767.6879882813,1351.2707519531,79.991928100586),
            ['CheckPoint_10'] = vector3(-2525.4467773438,1854.3233642578,165.37089538574),
            ['CheckPoint_11'] = vector3(-1812.9291992188,1907.5316162109,146.5418548584),
            ['CheckPoint_12'] = vector3(-2040.326171875,2329.826171875,34.632564544678),
            ['CheckPoint_13'] = vector3(-1526.8374023438,2399.4230957031,25.413782119751),
            ['CheckPoint_14'] = vector3(-537.12817382813,2847.0051269531,33.65417098999),
            ['CheckPoint_15'] = vector3(301.08285522461,2594.6201171875,43.861591339111),
            ['CheckPoint_16'] = vector3(561.69342041016,2451.4340820313,58.457313537598),
            ['CheckPoint_17'] = vector3(713.19799804688,2453.3112792969,59.862602233887),
            ['CheckPoint_18'] = vector3(807.3974609375,2699.4055175781,39.655311584473),
            ['CheckPoint_19'] = vector3(2259.5732421875,3007.0415039063,44.777027130127),
            ['CheckPoint_20'] = vector3(2556.2958984375,2193.5458984375,18.574256896973),
            ['CheckPoint_21'] = vector3(2392.6918945313,1184.0184326172,67.093811035156),
            ['CheckPoint_22'] = vector3(2627.9196777344,501.69952392578,97.093811035156),
            ['CheckPoint_23'] = vector3(1817.2713623047,-822.44763183594,79.093811035156),
            ['CheckPoint_24'] = vector3(-239.09603881836,-1201.4822998047,36.53882598877),
            ['CheckPoint_25'] = vector3(-449.04064941406,-1273.4509277344,44.500293731689),
            ['CheckPoint_26'] = vector3(-448.39221191406,-1559.2907714844,38.277412414551),
            ['CheckPoint_27'] = vector3(-889.43725585938,-1770.8935546875,37.21390914917),
        },

        SprintPoint = { -- จุดเช็คพ้อยแต่ละจุด

            ['SprintPoint_3'] = vector3(-1784.0338134766,4551.0185546875,1.0027928650379181),
            ['SprintPoint_5'] = vector3(-1613.1567382813,4415.2192382813,1.07127819955349),
            ['SprintPoint_7'] = vector3(-1113.1389160156,4401.044921875,9.6241254806519),
            ['SprintPoint_8'] = vector3(-803.27862548828,4437.138671875,14.813318252563),
            ['SprintPoint_9'] = vector3(-588.38000488281,4444.8408203125,14.791829109192),
            ['SprintPoint_11'] = vector3(-288.74871826172,4355.78125,30.12575340271),
            ['SprintPoint_12'] = vector3(-111.7001953125,4182.375,30.008712768555),



        },

        EndPoint = 27, -- จุดเส้นชัย โดยปกติแล้วจะตั้งเป็นจุดเช็คพ้อยสุดท้าย

        RewardWinner = { -- ตั้งค่าของรางวัล

            Winner1 = {ITEM = 'test1', Amount = 1},

            Winner2 = {ITEM = 'test1', Amount = 1},

            Winner3 = {ITEM = 'test1', Amount = 15},

            Winner4 = {ITEM = 'test1', Amount = 15},

            Winner5 = {ITEM = 'test1', Amount = 15}

        }

    },





    ['Mode_fly'] = {
        -- ค่าลงทะเบียน
        StartPoint = vector3(-1188.7470703125,-3049.986328125,13.944435119629), -- จุดดึงผูิ้เล่น 
        CountDown = 50, -- เวลาในการลงทะเบียนก่อนที่จะเริ่ม  เเนะนำให้ตั้งตามนาทีเพลง
        FlyMode = true,
        Boost = false,
        MarkerDist = 10.0,
        SpawnVeh = {

            -- {
            --     Point = 1, -- จุดเช็คพ้อยที่จะได้รถ
            --     VehicleName = 'elegy', -- ชื่อรถ
            --     DeletePoint = 12 -- จุดเช็คพ้อยที่จะลบรถ
            -- }

        },

        CheckPoint = {
            ['CheckPoint_1'] = vector3(-1207.6202392578,-3036.4401855469,13.94443321228),
            ['CheckPoint_2'] = vector3(-1170.3933105469,-2411.6889648438,73.919036865234),
            ['CheckPoint_3'] = vector3(-877.52307128906,-2175.5759277344,139.90992736816),
            ['CheckPoint_4'] = vector3(-367.63095092773,-1986.0172119141,79.880149841309),
            ['CheckPoint_5'] = vector3(859.06872558594,-1942.6060791016,121.75703430176),
            ['CheckPoint_6'] = vector3(829.10778808594,-680.60815429688,244.58601379395),
            ['CheckPoint_7'] = vector3(-30.771404266357,-801.39666748047,373.56253051758),
            ['CheckPoint_8'] = vector3(-390.04745483398,158.45568847656,142.46464538574),
            ['CheckPoint_9'] = vector3(-436.96228027344,1053.21484375,376.34494018555),
            ['CheckPoint_10'] = vector3(-64.328239440918,2179.3178710938,310.27355957031),
            ['CheckPoint_11'] = vector3(396.78005981445,3767.0275878906,106.24797821045),
            ['CheckPoint_12'] = vector3(1240.2946777344,4858.9995117188,263.16705322266),
            ['CheckPoint_13'] = vector3(517.68713378906,5573.8012695313,839.13037109375),

        },

        SprintPoint = { -- จุดเช็คพ้อยแต่ละจุด

        },

        EndPoint = 13, -- จุดเส้นชัย โดยปกติแล้วจะตั้งเป็นจุดเช็คพ้อยสุดท้าย

        RewardWinner = { -- ตั้งค่าของรางวัล

            Winner1 = {ITEM = 'test1', Amount = 1},

            Winner2 = {ITEM = 'test1', Amount = 1},

            Winner3 = {ITEM = 'test1', Amount = 15},

            Winner4 = {ITEM = 'test1', Amount = 15},

            Winner5 = {ITEM = 'test1', Amount = 15}

        }

    },



    ['Mode_test'] = {
        -- ค่าลงทะเบียน
        StartPoint = vector3(3321.219970703125, 5149.39990234375, 19.29000091552734), -- จุดดึงผูิ้เล่น 
        CountDown = 30, -- เวลาในการลงทะเบียนก่อนที่จะเริ่ม  เเนะนำให้ตั้งตามนาทีเพลง
        FlyMode = false,
        Boost = true,
        Effect = true,
        MarkerDist = 10.0,
        Marker = {id = 5, scalex = 20.0, scaley = 20.0, scalez = 20.0},
        SpawnVeh = {

             {
                 Point = 1, -- จุดเช็คพ้อยที่จะได้รถ
                 VehicleName = 'bf400', -- ชื่อรถ
                 DeletePoint = 6 -- จุดเช็คพ้อยที่จะลบรถ
             },
            {
                Point = 6, -- จุดเช็คพ้อยที่จะได้รถ
                VehicleName = 'trophytruck', -- ชื่อรถ
                DeletePoint = 19 -- จุดเช็คพ้อยที่จะลบรถ
            },
            {
                Point = 19, -- จุดเช็คพ้อยที่จะได้รถ
                VehicleName = 'seashark', -- ชื่อรถ
                DeletePoint = 25 -- จุดเช็คพ้อยที่จะลบรถ
            }

        },

        CheckPoint = {
            ['CheckPoint_1'] = vector3(3307.429931640625, 5148.14013671875, 18.25),
            ['CheckPoint_2'] = vector3(3204.43994140625, 5127.419921875, 17.46999931335449),
            ['CheckPoint_3'] = vector3(3057.030029296875, 5068.91015625, 24.6299991607666),
            ['CheckPoint_4'] = vector3(3050.81005859375, 4829.0400390625, 146.7899932861328),
            ['CheckPoint_5'] = vector3(2980.199951171875, 4619.35986328125, 52.54000091552734),
            ['CheckPoint_6'] = vector3(2799.06005859375, 4409.72998046875, 48.38999938964844),

            ['CheckPoint_7'] = vector3(2592.989990234375, 4267.22021484375, 42.18999862670898),
            ['CheckPoint_8'] = vector3(2471.89990234375, 4161.52001953125, 37.2400016784668),
            ['CheckPoint_9'] = vector3(2415.739990234375, 4625.93994140625, 36.65999984741211),
            ['CheckPoint_10'] = vector3(2194.6298828125, 4831, 44.59999847412109),
            ['CheckPoint_11'] = vector3(2067.85009765625, 4869.2099609375, 41.27000045776367),
            ['CheckPoint_12'] = vector3(2002.5999755859375, 4750.990234375, 40.79999923706055),
            ['CheckPoint_13'] = vector3(1787.949951171875, 4651.56005859375, 40.06000137329101),
            ['CheckPoint_14'] = vector3(1537.050048828125, 4554.25, 51.47999954223633),
            ['CheckPoint_15'] = vector3(1321.6500244140625, 4473.10009765625, 61.93000030517578),
            ['CheckPoint_16'] = vector3(826.0599975585938, 4413.33984375, 52.16999816894531),
            ['CheckPoint_17'] = vector3(544.77001953125, 4253.58984375, 52.7599983215332),
            ['CheckPoint_18'] = vector3(190.8300018310547, 4428.58984375, 73.30000305175781),
            ['CheckPoint_19'] = vector3(-228.35000610351565, 4327.919921875, 29.14999961853027),

            ['CheckPoint_20'] = vector3(-438.4599914550781, 4423.080078125, 30.06999969482422),
            ['CheckPoint_21'] = vector3(-705.780029296875, 4441.31982421875, 14.7200002670288),
            ['CheckPoint_22'] = vector3(-977.3599853515624, 4372.64013671875, 9.85999965667724),
            ['CheckPoint_23'] = vector3(-1445.3499755859375, 4327.419921875, 0.05000000074505),
            ['CheckPoint_24'] = vector3(-1736.780029296875, 4498.81005859375, 0),
            ['CheckPoint_25'] = vector3(-2022.530029296875, 4826.66015625, 2.30999994277954),
        },

        SprintPoint = { -- จุดเช็คพ้อยแต่ละจุด

            ['SprintPoint_4'] = vector3(3044.06005859375, 4974.2998046875, 46.2400016784668),
            ['SprintPoint_21'] = vector3(-497.8999938964844, 4417.64990234375, 29.44000053405761),

        },

        EndPoint = 25, -- จุดเส้นชัย โดยปกติแล้วจะตั้งเป็นจุดเช็คพ้อยสุดท้าย

        RewardWinner = { -- ตั้งค่าของรางวัล

            Winner1 = {ITEM = 'test1', Amount = 1},

            Winner2 = {ITEM = 'test1', Amount = 1},

            Winner3 = {ITEM = 'test1', Amount = 15},

            Winner4 = {ITEM = 'test1', Amount = 15},

            Winner5 = {ITEM = 'test1', Amount = 15}

        }

    },

}
