--===== FiveM Script: ========================================
--= DB - Health and Armor
--===== Developed By: ========================================
--= Azael Dev <contact@azael.dev>
--===== Website: =============================================
--= https://www.azael.dev/
--===== License: =============================================
--= You are not allowed to sell this script or edit
--============================================================

CONFIG.General = {                                          -- ทั่วไป
    Save = {                                                -- บันทึกข้อมูล "พลังชีวิต" และ "เกราะ" ไปยังฐานข้อมูลตามเวลาที่กำหนด (ป้องกันข้อมูล Rollback)
        Time = 15                                           -- เวลาในการบันทึกไปยังฐานข้อมูลทุกๆ X นาที (1 เท่ากับ 1 นาที) หรือ ระบุ 0 เพื่อปิดใช้งาน
    }
}
