Config = {}

Config.JailPositions = {
	mainPrison = {
		name =  "main_prison",
		position = {
			default = vector3(1779.70, 2580.05, 46.79),
			left = vector3(1648.3900146484375, 2428.43994140625, 46.52000045776367),
			right = vector3(1764.1700439453125, 2735.110107421875, 46.56000137329101),
		}
	},
	policePrison = {
		name = "police_station",
		position = vector3(486.1300048828125, -1005.8900146484376, 26.27000045776367)
	}
}

Config.ReleasePosition = {
	policePrison = {
		name = "police_station",
		position = vector3(410.4500122070313, -978.0700073242188, 30.42000007629394)
	}
}

Config.UniformsList = {  --ชุดนักโทษ
		male = {
			tshirt_1= 15, --เสื้อด้านใน
			tshirt_2= 0,   --สีเสื้อด้านใน
			torso_1= 86, --เสื้อนอก
			torso_2 = 0,  --สีเสื้อนอก
			arms= 8, 	--แขน/ถุงมือ
			pants_1 = 84,  --กางเกง
			pants_2= 0,  --สีกางเกง
			shoes_1  = 8,  --รองเท้า 
			shoes_2  = 0,  --สีรองเท้า
		},
		female = {
			tshirt_1= 3, --เสื้อด้านใน
			tshirt_2= 0,   --สีเสื้อด้านใน
			torso_1= 2, --เสื้อนอก
			torso_2 = 0,  --สีเสื้อนอก
			arms= 8, 	--แขน/ถุงมือ
			pants_1 = 3,  --กางเกง
			pants_2= 15,  --สีกางเกง
			shoes_1  = 215,  --รองเท้า 
			shoes_2  = 0,  --สีรองเท้า
		}
}

Config.Prisonzone = {
	{
		coords = {
            vector3(1658.6600341796875, 2391.1201171875, 45.40999984741211),
            vector3(1537.1800537109375, 2468.43994140625, 45.40999984741211),
            vector3(1531.22998046875, 2585.239990234375, 45.36999893188476),
            vector3(1566.8900146484375, 2682.409912109375, 45.38000106811523),
            vector3(1648.3299560546875, 2761.489990234375, 45.58000183105469),
            vector3(1774.239990234375, 2766.219970703125, 45.61000061035156),
            vector3(1852.27001953125, 2699.97998046875, 45.63000106811523),
            vector3(1827.5400390625, 2474.14990234375, 45.31999969482422),
			vector3(1763.22998046875, 2407.169921875, 45.38999938964844),
        },
        name = "main_prison_zone",
        debug = false,
        minZ = 40.0,
        maxZ = 100.0,
	}
}
