-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

Config.AllowOnlyNetworkedVehicles = false			-- อนุญาตให้ยานพาหนะที่เป็น Net ใช้งานได้เท่านั้น

Config.AllowVehicleOnTop = false					-- อนุญาตให้เปิดใช้งานช่องเก็บของยานพาหนะเมื่ออยู่บนยานพาหนะอื่นได้

Config.AllowOnlySeatFreeOnUseTrunk = false			-- อนุญาตให้เปิดใช้งานท้ายรถเมื่อไม่มีผู้เล่นอยู่ในที่นั่งคนขับเท่านั้น

Config.CheckTrunkForRealism = false					-- ใช้งานการเปิดท้ายยานพาหนะที่ด้านหลังยานพาหนะเท่านั้นเพื่อความสมจริง (ยานพาหนะบางชนิด)

Config.CanUseStoragesOfUndriveableVehicle = false	-- สามารถใช้งานช่องเก็บของยานพาหนะที่ไม่สามารถขับขี่ได้

Config.LimitPlayersToUseStorage = -1					-- กำหนดให้ผู้เล่นสามารถเปิดช่องเก็บของยานพาหนะพร้อมกันได้กี่คน [ -1: ไม่จำกัด ]

-- อนุญาตให้อาชีพที่กำหนดใช้งานช่องเก็บของยานพาหนะที่ "ไม่ล็อค" อยู่ได้
Config.AllowedJobsAccessUnlockedVehicles = {
	--['circle'] = true,
	['police'] = true,
}

-- อนุญาตให้อาชีพที่กำหนดใช้งานช่องเก็บของยานพาหนะที่ "ล็อค" อยู่ได้
Config.AllowedJobsAccessLockedVehicles = {
	--['circle'] = true,
	 ['police'] = true,
}

-- เลข Class ต่างๆของยานพาหนะ (ไม่ควรแก้ไข)
Config.VehicleClassesMap = {
	[0] = 'Compacts',
	[1] = 'Sedans',
	[2] = 'SUVs',
	[3] = 'Coupes',
	[4] = 'Muscle',
	[5] = 'Sports Classics',
	[6] = 'Sports',
	[7] = 'Super',
	[8] = 'Motorcycles',
	[9] = 'Off-road',
	[10] = 'Industrial',
	[11] = 'Utility',
	[12] = 'Vans',
	[13] = 'Cycles',
	[14] = 'Boats',
	[15] = 'Helicopters',
	[16] = 'Planes',
	[17] = 'Service',
	[18] = 'Emergency',
	[19] = 'Military',
	[20] = 'Commercial',
	[21] = 'Trains',
	[22] = 'Open Wheel'
}